{
  "purpleHouse": {
    "name": "บ้านม่วง (นักวิเคราะห์)",
    "types": {
      "INTJ": {
        "title": "นักวางแผนอัจฉริยะ",
        "characters": [
          {
            "name": "Light Yagami",
            "anime": "Death Note",
            "traits": {
              "I": "มักทำงานคนเดียวและชอบวางแผนในใจโดยไม่เปิดเผยต่อคนอื่น",
              "N": "มองโลกในแง่ของการสร้างระเบียบใหม่และมีความคิดริเริ่มที่จะเปลี่ยนแปลงสังคม",
              "T": "ใช้เหตุผลและการวิเคราะห์เป็นหลักในการตัดสินใจ แม้ในสถานการณ์ที่ซับซ้อน",
              "J": "วางแผนและปฏิบัติตามขั้นตอนที่ชัดเจนในการใช้ Death Note เพื่อบรรลุเป้าหมาย"
            }
          },
          {
            "name": "Lelouch vi Britannia",
            "anime": "Code Geass",
            "traits": {
              "I": "เป็นคนเงียบขรึมและลึกลับ มักเก็บความคิดของตัวเองไว้ในใจและไม่เปิดเผยให้คนอื่นรู้",
              "N": "มีมุมมองที่ลึกซึ้งและมักคิดถึงผลที่จะตามมาของการกระทำในระยะยาว",
              "T": "การตัดสินใจจะขึ้นอยู่กับความคำนึงถึงผลประโยชน์และเหตุผล แม้ต้องเผชิญกับการต่อสู้ทางจิตใจ",
              "J": "วางแผนการดำเนินการอย่างรอบคอบและเป็นระเบียบ พร้อมจะทำการเสียสละเพื่อความสำเร็จของเป้าหมาย"
            }
          },
          {
            "name": "Sosuke Aizen",
            "anime": "Bleach",
            "traits": {
              "I": "รักษาความลับและแผนการไว้ภายในตัวเองอย่างเงียบ ๆ",
              "N": "มีความสามารถในการมองเห็นภาพรวมและผลลัพธ์ในระยะยาวเพื่อควบคุมทุกสิ่ง",
              "T": "ตัดสินใจด้วยเหตุผลและวิเคราะห์สถานการณ์อย่างละเอียด",
              "J": "วางแผนและดำเนินการตามแผนอย่างแม่นยำ"
            }
          },
          {
            "name": "Shinobu Kocho",
            "anime": "Demon Slayer",
            "traits": {
              "I": "มักเก็บความคิดและแผนการไว้ภายใน ด้วยความเฉียบแหลมในการวิเคราะห์",
              "N": "มองเห็นสิ่งที่อยู่เบื้องหลังปัญหา และมองว่าความรู้คือกุญแจในการแก้ไขสถานการณ์",
              "T": "ตัดสินใจด้วยหลักตรรกะและความรู้ในการต่อสู้",
              "J": "ใช้วิธีการที่มีการวางแผนอย่างรัดกุมและมีขั้นตอนที่ชัดเจน"
            }
          }
        ]
      },
      "ENTJ": {
        "title": "ผู้นำเชิงกลยุทธ์",
        "characters": [
          {
            "name": "Erwin Smith",
            "anime": "Attack on Titan",
            "traits": {
              "E": "เป็นผู้นำที่สามารถกระตุ้นและสื่อสารกับทหารได้อย่างมั่นใจ",
              "N": "มองเห็นภาพรวมและแนวโน้มของอนาคตเพื่อวางแผนเปลี่ยนแปลงโลก",
              "T": "ตัดสินใจโดยใช้ตรรกะและข้อมูลจากการวิเคราะห์สถานการณ์",
              "J": "มีความเป็นระเบียบสูง วางแผนและดำเนินการตามกลยุทธ์ที่เตรียมไว้"
            }
          },
          {
            "name": "Roy Mustang",
            "anime": "Fullmetal Alchemist",
            "traits": {
              "E": "มีความเข้มแข็งในการสื่อสารและนำทีม มักแสดงออกและกระตือรือร้น",
              "N": "มีวิสัยทัศน์ในการปฏิรูปประเทศและเห็นแนวทางการเปลี่ยนแปลงสังคม",
              "T": "ตัดสินใจด้วยตรรกะและหลักเหตุผลในการวางแผนยุทธศาสตร์",
              "J": "วางแผนและดำเนินการตามขั้นตอนที่ชัดเจนเพื่อบรรลุเป้าหมาย"
            }
          },
          {
            "name": "Madara Uchiha",
            "anime": "Naruto",
            "traits": {
              "E": "แม้จะมีลักษณะสงบในบางครั้ง แต่สามารถแสดงอำนาจเมื่อจำเป็น",
              "N": "มีความเห็นลึกซึ้งและมีวิสัยทัศน์ที่ยิ่งใหญ่เกี่ยวกับอนาคตของโลกนินจา",
              "T": "ตัดสินใจโดยใช้เหตุผลอย่างรุนแรงและไม่ยอมให้ความรู้สึกเข้ามามีส่วน",
              "J": "วางแผนอย่างเป็นระบบและปฏิบัติตามเป้าหมายที่วางไว้"
            }
          },
          {
            "name": "Katsuki Bakugo",
            "anime": "My Hero Academia",
            "traits": {
              "E": "แสดงออกชัดเจนและมีพลังในการสื่อสารต่อสาธารณะอย่างมั่นใจ",
              "N": "มองเห็นเป้าหมายในการเป็นฮีโร่ที่ดีที่สุดและตั้งเป้าหมายให้ตัวเอง",
              "T": "ตัดสินใจด้วยตรรกะและมุ่งเน้นในการต่อสู้เพื่อเอาชนะอุปสรรค",
              "J": "พยายามวางแผนและจัดการสถานการณ์ให้เป็นระเบียบ"
            }
          }
        ]
      },
      "INTP": {
        "title": "นักคิดวิเคราะห์ลึกซึ้ง",
        "characters": [
          {
            "name": "L Lawliet",
            "anime": "Death Note",
            "traits": {
              "I": "ใช้เวลาส่วนใหญ่ในการคิดวิเคราะห์อย่างลึกซึ้งและทำงานอย่างเงียบ ๆ",
              "N": "มีความสามารถในการมองเห็นภาพรวมและความสัมพันธ์ที่ซับซ้อนในคดีต่าง ๆ",
              "T": "การตัดสินใจขึ้นอยู่กับตรรกะและหลักฐานที่พิสูจน์ได้",
              "P": "มีความยืดหยุ่นในกระบวนการสืบสวน ปรับเปลี่ยนวิธีการตามข้อมูลใหม่"
            }
          },
          {
            "name": "Shikamaru Nara",
            "anime": "Naruto",
            "traits": {
              "I": "ชอบคิดวิเคราะห์และไม่ชอบแสดงออกมากนัก",
              "N": "มีความสามารถในการเห็นลวดลายและวิเคราะห์สถานการณ์ล่วงหน้า",
              "T": "ตัดสินใจโดยใช้เหตุผลและตรรกะ แม้บางครั้งจะดูขี้เกียจ",
              "P": "มีความยืดหยุ่นในแผนการต่อสู้ ปรับเปลี่ยนกลยุทธ์ตามสถานการณ์"
            }
          },
          {
            "name": "Senku Ishigami",
            "anime": "Dr. Stone",
            "traits": {
              "I": "ชอบใช้เวลาคิดค้นและวิจัยในห้องทดลองอย่างเข้มข้น",
              "N": "มีวิสัยทัศน์ในการฟื้นฟูโลกผ่านนวัตกรรมทางวิทยาศาสตร์",
              "T": "ตัดสินใจโดยอิงหลักตรรกะและหลักฐานทางวิทยาศาสตร์",
              "P": "แสดงความยืดหยุ่นในการทดลองและปรับเปลี่ยนวิธีการแก้ปัญหา"
            }
          },
          {
            "name": "Kakashi Hatake",
            "anime": "Naruto",
            "traits": {
              "I": "มักเก็บความรู้สึกไว้ภายในและให้ความสำคัญกับการคิดวิเคราะห์",
              "N": "ใช้สัญชาตญาณและความเข้าใจลึกซึ้งเพื่อคาดการณ์การเคลื่อนไหวของศัตรู",
              "T": "ตัดสินใจด้วยตรรกะและประสบการณ์ในสนามรบ",
              "P": "มีความยืดหยุ่นในการปรับกลยุทธ์เมื่อเผชิญกับสถานการณ์ใหม่ ๆ"
            }
          }
        ]
      },
      "ENTP": {
        "title": "ผู้คิดริเริ่มและชอบทดลอง",
        "characters": [
          {
            "name": "Hisoka Morow",
            "anime": "Hunter x Hunter",
            "traits": {
              "E": "แสดงออกอย่างชัดเจนและชอบมีปฏิสัมพันธ์กับผู้อื่น",
              "N": "มีความคิดสร้างสรรค์และชอบทดลองแนวทางใหม่ ๆ ในการต่อสู้",
              "T": "ตัดสินใจด้วยตรรกะที่เฉียบแหลมและไม่กลัวที่จะท้าทายขีดจำกัด",
              "P": "มีความยืดหยุ่นสูง ปรับแผนตามสถานการณ์เพื่อให้ได้เปรียบคู่ต่อสู้"
            }
          },
          {
            "name": "Satoru Gojo",
            "anime": "Jujutsu Kaisen",
            "traits": {
              "E": "มีบุคลิกที่เปิดเผยและมั่นใจ สร้างความประทับใจแก่เพื่อนร่วมสู้",
              "N": "มองเห็นโอกาสและศักยภาพในพลังของตนเองและสถานการณ์รอบ ๆ",
              "T": "การตัดสินใจอิงตรรกะและความรู้ในศาสตร์ของคำสาป",
              "P": "มีความสามารถในการปรับเปลี่ยนกลยุทธ์ในสนามรบอย่างทันทีทันใด"
            }
          },
          {
            "name": "Joseph Joestar",
            "anime": "JoJo's Bizarre Adventure",
            "traits": {
              "E": "มีบุคลิกที่เข้ากับสังคมได้ดีและชอบใช้ความตลกขบขันในการต่อสู้",
              "N": "มีมุมมองที่กว้างไกลและมองเห็นโอกาสในเหตุการณ์ที่ดูเหมือนจะไม่เกี่ยวข้องกัน",
              "T": "ตัดสินใจโดยใช้ความเฉลียวฉลาดและประสบการณ์ที่สะสมมา",
              "P": "สามารถปรับเปลี่ยนแผนได้อย่างรวดเร็วและใช้การจินตนาการสร้างสรรค์"
            }
          },
          {
            "name": "Yato",
            "anime": "Noragami",
            "traits": {
              "E": "เป็นคนที่เปิดเผยและชอบเข้าสังคม แม้จะมีความลึกลับในบางครั้ง",
              "N": "มองเห็นศักยภาพและโอกาสใหม่ ๆ ในโลกที่เต็มไปด้วยความท้าทาย",
              "T": "ตัดสินใจโดยใช้ความเฉียบแหลมและความคิดริเริ่มในการต่อสู้กับอุปสรรค",
              "P": "มีความยืดหยุ่นสูง ปรับเปลี่ยนวิธีการได้ตามสถานการณ์ที่เกิดขึ้น"
            }
          }
        ]
      }
    }
  },
  "greenHouse": {
    "name": "บ้านเขียว (นักการทูต)",
    "types": {
      "INFJ": {
        "title": "ผู้สนับสนุนที่มีอุดมการณ์และเสียสละ",
        "characters": [
          {
            "name": "Itachi Uchiha",
            "anime": "Naruto",
            "traits": {
              "I": "Itachi มักเก็บความรู้สึกและความคิดไว้ภายใน รักษาความลับเกี่ยวกับแผนการของตัวเอง",
              "N": "เขามีวิสัยทัศน์ที่ลึกซึ้ง มองเห็นผลในอนาคตและผลกระทบที่ตามมา",
              "F": "การตัดสินใจของเขามักขึ้นอยู่กับค่านิยมและความรักที่มีต่อหมู่บ้าน แม้จะต้องเผชิญกับความขัดแย้ง",
              "J": "วางแผนและดำเนินการอย่างมีระบบแม้จะต้องเสียสละตัวเองเพื่อประโยชน์ส่วนรวม"
            }
          },
          {
            "name": "Armin Arlert",
            "anime": "Attack on Titan",
            "traits": {
              "I": "ชอบคิดวิเคราะห์อยู่เบื้องหลัง มักใช้เวลาไตร่ตรองก่อนแสดงความคิดเห็น",
              "N": "มีความสามารถในการมองเห็นแนวโน้มในอนาคตและวางแผนยุทธศาสตร์เพื่อเอาชนะอุปสรรค",
              "F": "ใส่ใจในความรู้สึกของเพื่อนร่วมสู้และมุ่งหวังให้ทุกคนอยู่รอดด้วยกัน",
              "J": "มีความเป็นระบบในการวางแผนและดำเนินการเมื่อถึงเวลาที่ต้องตัดสินใจ"
            }
          },
          {
            "name": "Tamayo",
            "anime": "Demon Slayer",
            "traits": {
              "I": "เป็นผู้ที่รักษาความสงบและเก็บความคิดไว้ภายในก่อนลงมือทำ",
              "N": "มองเห็นรายละเอียดและความลับที่ซ่อนอยู่ในสถานการณ์ต่าง ๆ ซึ่งช่วยให้เธอค้นพบทางออก",
              "F": "ด้วยความเห็นอกเห็นใจ เธอมุ่งมั่นช่วยเหลือทั้งมนุษย์และปีศาจ โดยคำนึงถึงความรู้สึกของผู้อื่น",
              "J": "ใช้การวางแผนอย่างรัดกุมในการวิจัยและรักษาโรคของผู้ป่วยอย่างเป็นระบบ"
            }
          },
          {
            "name": "Izuku Midoriya",
            "anime": "My Hero Academia",
            "traits": {
              "I": "เป็นคนที่ค่อนข้างเงียบสงบและมักคิดวิเคราะห์ภายในใจก่อนแสดงออก",
              "N": "มีความฝันและวิสัยทัศน์ในการเป็นฮีโร่ที่แท้จริง มองเห็นศักยภาพในตัวเองแม้ในช่วงที่อ่อนแอ",
              "F": "การตัดสินใจของเขาขับเคลื่อนด้วยความรักและความห่วงใยต่อเพื่อนร่วมทีม",
              "J": "วางแผนฝึกฝนและติดตามความก้าวหน้าของตัวเองอย่างมีระเบียบและตั้งเป้าหมายชัดเจน"
            }
          }
        ]
      },
      "ENFJ": {
        "title": "ผู้นำที่อบอุ่นและสร้างแรงบันดาลใจ",
        "characters": [
          {
            "name": "Tanjiro Kamado",
            "anime": "Demon Slayer",
            "traits": {
              "E": "เปิดเผยและเข้าถึงผู้คนได้ง่าย เขามักสื่อสารและแสดงออกถึงความห่วงใยต่อผู้อื่น",
              "N": "มีความมองเห็นภาพใหญ่เกี่ยวกับอนาคตและแรงบันดาลใจในการปกป้องผู้ที่อ่อนแอ",
              "F": "การตัดสินใจของเขาขับเคลื่อนด้วยความรักและความเมตตา ไม่ยอมเห็นความทุกข์ของเพื่อนร่วมสู้",
              "J": "มีความตั้งใจและมีแผนการที่ชัดเจนในการฝึกฝนและปฏิบัติหน้าที่เพื่อปกป้องคนที่รัก"
            }
          },
          {
            "name": "All Might",
            "anime": "My Hero Academia",
            "traits": {
              "E": "มีบุคลิกที่เข้าถึงง่ายและเป็นสัญลักษณ์แห่งความหวังสำหรับผู้คน",
              "N": "มองเห็นอนาคตที่สดใสและสร้างแรงบันดาลใจให้คนรอบข้างเชื่อในความเป็นฮีโร่",
              "F": "การกระทำของเขาขับเคลื่อนด้วยความห่วงใยและความปรารถนาที่จะช่วยเหลือสังคม",
              "J": "มีการวางแผนและความเป็นระเบียบในวิธีการปฏิบัติหน้าที่ในการรักษาความสงบเรียบร้อย"
            }
          },
          {
            "name": "Minato Namikaze",
            "anime": "Naruto",
            "traits": {
              "E": "เป็นผู้นำที่เข้าถึงและมีเสน่ห์ในการสื่อสารกับชาวบ้าน",
              "N": "มีวิสัยทัศน์และเห็นโอกาสในการสร้างอนาคตที่สงบสุข",
              "F": "การตัดสินใจของเขามีรากฐานมาจากความรักและความรับผิดชอบต่อครอบครัวและหมู่บ้าน",
              "J": "มีความเป็นระเบียบและมีแผนการที่ชัดเจนในฐานะฮอคาเงะที่ต้องบริหารจัดการสถานการณ์ฉุกเฉิน"
            }
          },
          {
            "name": "Lucy Heartfilia",
            "anime": "Fairy Tail",
            "traits": {
              "E": "มีบุคลิกที่เป็นมิตร เข้ากับเพื่อน ๆ ในแก๊งได้ง่ายและเต็มไปด้วยความอบอุ่น",
              "N": "มีจินตนาการและมองเห็นอนาคตที่สดใสร่วมกับเพื่อนร่วมทีม",
              "F": "การตัดสินใจของเธอขับเคลื่อนด้วยความรู้สึกและความรักในมิตรภาพ",
              "J": "ค่อนข้างเป็นระเบียบเมื่อทำงานร่วมกับทีมและดูแลหน้าที่ที่ได้รับมอบหมาย"
            }
          }
        ]
      },
      "INFP": {
        "title": "ผู้ใฝ่หาความหมายและความงดงามในใจ",
        "characters": [
          {
            "name": "Ken Kaneki",
            "anime": "Tokyo Ghoul",
            "traits": {
              "I": "เป็นคนที่ใคร่ครวญและมักต่อสู้กับความขัดแย้งภายในตัวเอง",
              "N": "มองเห็นความซับซ้อนของชีวิตและค้นหาความหมายในโลกที่โหดร้าย",
              "F": "การตัดสินใจของเขามาจากใจและความปรารถนาอย่างแรงกล้าที่จะทำความถูกต้อง",
              "P": "แสดงความยืดหยุ่นในการปรับตัวและเปิดรับประสบการณ์ใหม่ ๆ แม้จะผ่านการเปลี่ยนแปลงครั้งใหญ่ในชีวิต"
            }
          },
          {
            "name": "Nezuko Kamado",
            "anime": "Demon Slayer",
            "traits": {
              "I": "แสดงออกในแบบที่เงียบสงบและเก็บความรู้สึกไว้ภายใน",
              "N": "แม้จะไม่พูด แต่เธอสามารถรับรู้สภาพแวดล้อมและเปลี่ยนแปลงตามสถานการณ์ได้ดี",
              "F": "ความรักและความห่วงใยในพี่ชายเป็นแรงขับเคลื่อนหลักในการปกป้องครอบครัว",
              "P": "มีความยืดหยุ่นในการปรับตัว แม้ผ่านการเปลี่ยนแปลงจากมนุษย์เป็นปีศาจ"
            }
          },
          {
            "name": "Gaara",
            "anime": "Naruto",
            "traits": {
              "I": "มีความรู้สึกภายในที่ลึกซึ้งและมักเงียบขรึมเนื่องจากอดีตที่เจ็บปวด",
              "N": "เริ่มมองเห็นคุณค่าและความสัมพันธ์ที่มีความหมายในชีวิตหลังจากการเปลี่ยนแปลง",
              "F": "การตัดสินใจของเขาค่อย ๆ ขับเคลื่อนด้วยความรู้สึกของความรักและการยอมรับในตัวเอง",
              "P": "ปรับตัวและเติบโตจากความโดดเดี่ยวสู่การเป็นผู้นำที่มีความอ่อนโยน"
            }
          },
          {
            "name": "Chopper",
            "anime": "One Piece",
            "traits": {
              "I": "มีความเป็นตัวของตัวเองและมักไตร่ตรองภายในใจ",
              "N": "มีความฝันที่จะช่วยเหลือและเปลี่ยนแปลงโลกให้ดีขึ้น",
              "F": "ตัดสินใจจากความรู้สึกและความต้องการที่จะช่วยเหลือผู้อื่น",
              "P": "ยืดหยุ่นและพร้อมปรับตัวตามสถานการณ์ที่ไม่คาดคิด"
            }
          }
        ]
      },
      "ENFP": {
        "title": "ผู้ใฝ่หาความฝันและความเป็นอิสระในใจ",
        "characters": [
          {
            "name": "Luffy",
            "anime": "One Piece",
            "traits": {
              "E": "มีบุคลิกที่เข้ากับคนอื่นได้ดี เขาเป็นตัวกลางที่กระตุ้นความสนุกและความเป็นมิตร",
              "N": "มีจินตนาการและมองเห็นความเป็นไปได้ในโลกกว้างไกล",
              "F": "ตัดสินใจจากหัวใจและความปรารถนาอย่างแรงกล้าในการปกป้องเพื่อนร่วมทีม",
              "P": "เป็นคนที่ปรับตัวได้ดีในทุกสถานการณ์และไม่ยึดติดกับแผนเดิม ๆ"
            }
          },
          {
            "name": "Anya Forger",
            "anime": "Spy x Family",
            "traits": {
              "E": "มีความกระตือรือร้นและชอบมีปฏิสัมพันธ์กับคนรอบข้าง",
              "N": "มักแสดงจินตนาการที่สดใส และมองเห็นความเป็นไปได้ในสถานการณ์ต่าง ๆ",
              "F": "การตัดสินใจขับเคลื่อนด้วยความรู้สึกและความรักที่มีต่อครอบครัว adoptive ของเธอ",
              "P": "แสดงความยืดหยุ่นและปรับตัวได้ง่ายในทุกสถานการณ์ที่เกิดขึ้น"
            }
          },
          {
            "name": "Finn",
            "anime": "Adventure Time",
            "traits": {
              "E": "มีพลังและชอบเข้าสังคม ชอบออกผจญภัยและพบปะผู้คนใหม่ๆ",
              "N": "มองเห็นความเป็นไปได้ในทุกสถานการณ์และเต็มไปด้วยจินตนาการ",
              "F": "ตัดสินใจโดยใช้ความรู้สึก มีความเห็นอกเห็นใจและรักเพื่อนมาก",
              "P": "ยืดหยุ่น ปรับตัวกับการเปลี่ยนแปลง และพร้อมลุยไปกับสถานการณ์ตรงหน้า"
            }
          },
          {
            "name": "Kaori Miyazono",
            "anime": "Your Lie in April",
            "traits": {
              "E": "มีบุคลิกที่เปิดเผยและเต็มไปด้วยชีวิตชีวา ทำให้เธอเข้าถึงผู้คนได้ง่าย",
              "N": "มีความสามารถในการมองเห็นความงดงามและแรงบันดาลใจในดนตรีและชีวิต",
              "F": "การตัดสินใจของเธอขับเคลื่อนด้วยความรู้สึกและการแสดงออกทางอารมณ์",
              "P": "มีความยืดหยุ่นและพร้อมที่จะปรับเปลี่ยนแผนในทุกการแสดงออกที่สร้างสรรค์"
            }
          }
        ]
      }
    }
  },
  "blueHouse": {
    "name": "บ้านฟ้า (ผู้พิทักษ์ปกป้อง)",
    "types": {
      "ISTJ": {
        "title": "ผู้พิทักษ์ที่เข้มงวดและมีความรับผิดชอบ",
        "characters": [
          {
            "name": "Mikasa Ackerman",
            "anime": "Attack on Titan",
            "traits": {
              "I": "Mikasa เก็บความคิดและอารมณ์ไว้ภายใน ทำงานโดยไม่ต้องแสดงออกมาก",
              "S": "เธอเน้นการใช้ประสบการณ์ตรงและข้อมูลที่จับต้องได้ในการต่อสู้",
              "T": "ตัดสินใจจากตรรกะและความเป็นระบบในทุกสถานการณ์",
              "J": "มีวินัยและการวางแผนที่เข้มงวด เพื่อปกป้องเพื่อนร่วมทีมในทุกสถานการณ์"
            }
          },
          {
            "name": "Megumi Fushiguro",
            "anime": "Jujutsu Kaisen",
            "traits": {
              "I": "มุ่งเน้นในการคิดวิเคราะห์แบบเงียบ ๆ และทำงานเป็นทีมโดยไม่ต้องแสดงออกมาก",
              "S": "ใช้ข้อมูลจากประสบการณ์ตรงในการต่อสู้กับคำสาป",
              "T": "ตัดสินใจด้วยเหตุผลและความเป็นระบบในการวางแผนยุทธศาสตร์",
              "J": "มีความเข้มงวดและปฏิบัติตามกฎเกณฑ์อย่างเคร่งครัดในทุกภารกิจ"
            }
          },
          {
            "name": "Levi Ackerman",
            "anime": "Attack on Titan",
            "traits": {
              "I": "Levi เก็บความรู้สึกไว้ภายในและมุ่งเน้นในงานต่อสู้อย่างเข้มข้น",
              "S": "ใช้ประสบการณ์ตรงและข้อมูลที่จับต้องได้ในการวิเคราะห์สถานการณ์",
              "T": "ตัดสินใจโดยอิงตรรกะและการคิดอย่างมีระบบ",
              "J": "มีระเบียบวินัยสูงและดำเนินการตามแผนอย่างเด็ดขาดเพื่อความปลอดภัยของทีม"
            }
          },
          {
            "name": "Giyu Tomioka",
            "anime": "Demon Slayer",
            "traits": {
              "I": "Giyu เป็นคนที่เงียบสงบและเก็บความรู้สึกไว้ภายใน",
              "S": "ให้ความสำคัญกับสิ่งที่จับต้องได้และสังเกตสภาพแวดล้อมในสนามรบ",
              "T": "ตัดสินใจด้วยตรรกะและประสบการณ์ตรงจากการต่อสู้",
              "J": "ปฏิบัติงานตามหลักเกณฑ์และกฎระเบียบอย่างเคร่งครัด แม้จะดูเย็นชาในบางครั้ง"
            }
          }
        ]
      },
      "ESTJ": {
        "title": "ผู้พิทักษ์ที่มีความเป็นผู้นำและชัดเจนในกฎเกณฑ์",
        "characters": [
          {
            "name": "Erza Scarlet",
            "anime": "Fairy Tail",
            "traits": {
              "E": "Erza มีบุคลิกที่เข้มแข็งและสามารถสื่อสารเพื่อรวบรวมทีม",
              "S": "เธอเน้นความเป็นจริงและใช้ประสบการณ์ตรงในการต่อสู้",
              "T": "ตัดสินใจด้วยตรรกะและความยุติธรรมในทุกสถานการณ์",
              "J": "มีระเบียบวินัยและการวางแผนที่เข้มงวดเพื่อบริหารจัดการทีม"
            }
          },
          {
            "name": "Jean Kirstein",
            "anime": "Attack on Titan",
            "traits": {
              "E": "Jean สามารถสื่อสารและทำงานร่วมกับทีมได้อย่างชัดเจน",
              "S": "ใช้ข้อมูลที่จับต้องได้และสถานการณ์จริงในการตัดสินใจ",
              "T": "ตัดสินใจด้วยตรรกะและวิเคราะห์ปัญหาอย่างเป็นระบบ",
              "J": "มีความเป็นระเบียบและวางแผนจัดการภารกิจในสถานการณ์วิกฤต"
            }
          },
          {
            "name": "Tsunade",
            "anime": "Naruto",
            "traits": {
              "E": "Tsunade เป็นผู้นำที่สามารถสื่อสารและสร้างแรงบันดาลใจให้กับหมู่บ้าน",
              "S": "ให้ความสำคัญกับประสบการณ์ตรงและสถานการณ์จริงในการดูแลทีม",
              "T": "ตัดสินใจด้วยตรรกะและประสบการณ์ที่ผ่านมาของเธอในการบริหารจัดการ",
              "J": "วางแผนและดำเนินการด้วยความเป็นระเบียบเพื่อรับมือกับสถานการณ์วิกฤต"
            }
          },
          {
            "name": "Tenya Iida",
            "anime": "My Hero Academia",
            "traits": {
              "E": "Iida มีบุคลิกที่เข้มแข็งและสามารถสื่อสารกับเพื่อนร่วมทีมได้",
              "S": "ให้ความสำคัญกับความถูกต้องและข้อมูลที่เป็นรูปธรรม",
              "T": "ตัดสินใจด้วยตรรกะและการวิเคราะห์สถานการณ์อย่างแม่นยำ",
              "J": "มีความเป็นระเบียบและวางแผนอย่างเข้มข้นเพื่อรักษาความปลอดภัยและความถูกต้องในทุกภารกิจ"
            }
          }
        ]
      },
      "ISFJ": {
        "title": "ผู้พิทักษ์ที่อ่อนโยนและใส่ใจในรายละเอียด",
        "characters": [
          {
            "name": "Hinata Hyuga",
            "anime": "Naruto",
            "traits": {
              "I": "Hinata มักเก็บความรู้สึกไว้ภายในและแสดงออกอย่างอ่อนโยน",
              "S": "เธอเน้นสังเกตสิ่งที่เกิดขึ้นจริงและให้ความสำคัญกับรายละเอียดในชีวิต",
              "F": "ตัดสินใจจากความรู้สึกและความห่วงใยต่อเพื่อนและครอบครัว",
              "J": "มีการวางแผนและความรับผิดชอบในการปฏิบัติงานเพื่อปกป้องคนที่รัก"
            }
          },
          {
            "name": "Historia Reiss",
            "anime": "Attack on Titan",
            "traits": {
              "I": "Historia มีความอ่อนโยนและคิดวิเคราะห์ในระดับส่วนตัว",
              "S": "ให้ความสำคัญกับข้อมูลที่จับต้องได้และประสบการณ์ตรงจากชีวิต",
              "F": "ตัดสินใจด้วยความรู้สึกและมุ่งหวังให้เกิดการเปลี่ยนแปลงในทางที่ดี",
              "J": "มีความเป็นระเบียบและวางแผนเพื่อความมั่นคงในชีวิตและสังคม"
            }
          },
          {
            "name": "Momo Yaoyorozu",
            "anime": "My Hero Academia",
            "traits": {
              "I": "Momo ชอบทำงานในแนวคิดส่วนตัวและศึกษาอย่างละเอียด",
              "S": "เน้นใช้ข้อมูลที่จับต้องได้และประสบการณ์ตรงในการแก้ปัญหา",
              "F": "ตัดสินใจจากความรู้สึกและมีความใส่ใจในทีมและเพื่อนร่วมงาน",
              "J": "มีการวางแผนและดำเนินการอย่างเป็นระบบเพื่อให้ทุกอย่างเป็นไปตามที่วางไว้"
            }
          },
          {
            "name": "Mitsuha Miyamizu",
            "anime": "Your Name",
            "traits": {
              "I": "Mitsuha มีความเงียบสงบและใช้เวลาคิดวิเคราะห์ภายในใจ",
              "S": "ให้ความสำคัญกับประสบการณ์ตรงและสถานการณ์จริงในชีวิตประจำวัน",
              "F": "ตัดสินใจจากความรู้สึกที่ลึกซึ้งและความปรารถนาที่จะแก้ไขชะตากรรม",
              "J": "มีการวางแผนและการปรับตัวตามเหตุการณ์ที่เกิดขึ้นในชีวิตด้วยความเป็นระเบียบ"
            }
          }
        ]
      },
      "ESFJ": {
        "title": "ผู้พิทักษ์ที่อบอุ่นและดูแลผู้อื่น",
        "characters": [
          {
            "name": "Ochaco Uraraka",
            "anime": "My Hero Academia",
            "traits": {
              "E": "Ochaco มีบุคลิกที่เข้าถึงง่ายและมักยิ้มแย้มแจ่มใส",
              "S": "เธอให้ความสำคัญกับสิ่งที่จับต้องได้และสถานการณ์จริงในสนามรบ",
              "F": "ตัดสินใจด้วยความรู้สึกและความห่วงใยต่อเพื่อนร่วมทีม",
              "J": "มีความเป็นระเบียบและพร้อมดูแลให้ทุกอย่างเป็นไปตามแผนที่วางไว้"
            }
          },
          {
            "name": "Reiner Braun",
            "anime": "Attack on Titan",
            "traits": {
              "E": "แม้ Reiner จะมีบุคลิกที่ซับซ้อน แต่ยังสามารถเข้าสังคมและแสดงออกในบางครั้ง",
              "S": "ให้ความสำคัญกับข้อมูลและประสบการณ์ตรงในการวิเคราะห์สถานการณ์",
              "F": "แม้จะไม่แสดงออกชัดเจน แต่ในบางแง่มุมยังแสดงความห่วงใยต่อเพื่อนร่วมทีม",
              "J": "พยายามรักษาความเป็นระเบียบในการปฏิบัติงานแม้มีความขัดแย้งภายใน"
            }
          },
          {
            "name": "Sakura Haruno",
            "anime": "Naruto",
            "traits": {
              "E": "Sakura สามารถแสดงออกและสื่อสารกับทีมได้อย่างชัดเจน",
              "S": "มุ่งเน้นที่ประสบการณ์ตรงและความเป็นจริงในงานดูแลเพื่อนร่วมทีม",
              "F": "ตัดสินใจด้วยความรู้สึกและความห่วงใยในการพัฒนาตนเองเพื่อช่วยเหลือผู้อื่น",
              "J": "มีความเป็นระเบียบและวางแผนเพื่อพัฒนาความสามารถของตนเองอย่างต่อเนื่อง"
            }
          },
          {
            "name": "Maka Albarn",
            "anime": "Soul Eater",
            "traits": {
              "E": "Maka มีบุคลิกที่เปิดเผยและเป็นมิตรกับเพื่อนร่วมทีม",
              "S": "ให้ความสำคัญกับสิ่งที่จับต้องได้และใช้ประสบการณ์ตรงในการต่อสู้กับปีศาจ",
              "F": "ตัดสินใจด้วยความรู้สึกและความมุ่งหวังที่จะปกป้องเพื่อนร่วมทีม",
              "J": "มีความเป็นระเบียบและวางแผนดำเนินการตามภารกิจอย่างมั่นใจ"
            }
          }
        ]
      }
    }
  },
  "yellowHouse": {
    "name": "บ้านเหลือง (นักสำรวจ)",
    "types": {
      "ISTP": {
        "title": "นักแก้ปัญหาในสนามรบที่เน้นประสบการณ์ตรง",
        "characters": [
          {
            "name": "Sasuke Uchiha",
            "anime": "Naruto",
            "traits": {
              "I": "Sasuke มักเก็บความรู้สึกไว้ภายในและทำงานอย่างเงียบๆ เพื่อความสำเร็จส่วนตัว",
              "S": "เขาให้ความสำคัญกับรายละเอียดและการฝึกฝนที่จับต้องได้ในการต่อสู้",
              "T": "ตัดสินใจโดยใช้ตรรกะและความมุ่งมั่นในการบรรลุเป้าหมายส่วนตัว",
              "P": "Sasukeแสดงความยืดหยุ่นในการเปลี่ยนแปลงกลยุทธ์ตามสถานการณ์ที่ท้าทาย"
            }
          },
          {
            "name": "Saitama",
            "anime": "One Punch Man",
            "traits": {
              "I": "Saitama ชอบใช้เวลาส่วนใหญ่กับตนเองและไม่ค่อยให้ความสำคัญกับสังคม",
              "S": "เขาเผชิญหน้ากับศัตรูด้วยการใช้ประสบการณ์และความรู้สึกที่จับต้องได้",
              "T": "ตัดสินใจอย่างตรงไปตรงมาโดยอิงจากตรรกะและประสิทธิภาพในการต่อสู้",
              "P": "Saitama ไม่ยึดติดกับแผนที่ซับซ้อน แต่ปรับตัวตามสถานการณ์ได้อย่างง่ายดาย"
            }
          },
          {
            "name": "Toji Fushiguro",
            "anime": "Jujutsu Kaisen",
            "traits": {
              "I": "Toji เป็นคนที่เงียบสงบและเน้นการปฏิบัติจริงในสนามรบ",
              "S": "เขาใช้ประสบการณ์และสัญชาตญาณในการประเมินความเสี่ยงและจังหวะในศึก",
              "T": "ตัดสินใจด้วยเหตุผลที่เย็นชาและการคำนวณที่แม่นยำ",
              "P": "Toji มีความยืดหยุ่นสูงในการปรับเปลี่ยนกลยุทธ์ตามสถานการณ์ที่เกิดขึ้นทันที"
            }
          },
          {
            "name": "Vegeta",
            "anime": "Dragon Ball Z",
            "traits": {
              "I": "Vegeta มักเก็บความคิดไว้ภายในและมุ่งมั่นฝึกฝนเพื่อพัฒนาตนเอง",
              "S": "เขาเน้นการใช้ประสบการณ์ตรงและการวัดผลจากการฝึกฝนที่จับต้องได้",
              "T": "ตัดสินใจด้วยตรรกะที่คำนึงถึงการแข่งขันและความภูมิใจส่วนตัว",
              "P": "Vegeta ปรับเปลี่ยนวิธีการต่อสู้และแผนกลยุทธ์เมื่อเผชิญกับคู่ต่อสู้ที่แข็งแกร่ง"
            }
          }
        ]
      },
      "ESTP": {
        "title": "นักผจญภัยที่ชอบลงมือทำและตอบสนองทันที",
        "characters": [
          {
            "name": "Roronoa Zoro",
            "anime": "One Piece",
            "traits": {
              "E": "มีความกระตือรือร้นในการผจญภัยและแสดงออกอย่างชัดเจน",
              "S": "ใช้ทักษะการต่อสู้และประสบการณ์ในการเผชิญหน้ากับศัตรู",
              "T": "ตัดสินใจด้วยเหตุผลที่ต้องการเอาชนะศัตรู",
              "P": "ปรับตัวอย่างรวดเร็วเมื่อเผชิญกับสถานการณ์ที่เปลี่ยนแปลง"
            }
          },
          {
            "name": "Edward Elric",
            "anime": "Fullmetal Alchemist",
            "traits": {
              "E": "Edward มีความกระตือรือร้นและมักแสดงออกผ่านการลงมือทำ",
              "S": "เขาใช้ความรู้ที่จับต้องได้จากประสบการณ์ตรงในโลกแห่งอัลเคมีย์",
              "T": "ตัดสินใจด้วยตรรกะและการวิเคราะห์ปัญหาที่ซับซ้อน",
              "P": "Edward มีความยืดหยุ่นในการปรับตัวและทดลองหาวิธีแก้ปัญหาใหม่ ๆ ตามสถานการณ์"
            }
          },
          {
            "name": "Yuji Itadori",
            "anime": "Jujutsu Kaisen",
            "traits": {
              "E": "Yuji เป็นคนที่มีพลังงานและชอบเข้าสังคม พร้อมแสดงออกในสนามรบ",
              "S": "เขาเน้นตอบสนองต่อสถานการณ์จริงด้วยสัญชาตญาณ",
              "T": "แม้จะมีความรู้สึกเข้ามาแทรก แต่ Yuji มักตัดสินใจด้วยความเป็นจริงและผลลัพธ์ที่จับต้องได้",
              "P": "เขาแสดงความยืดหยุ่นและพร้อมปรับตัวในทุกสถานการณ์ที่ไม่คาดคิด"
            }
          },
          {
            "name": "Jiraiya",
            "anime": "Naruto",
            "traits": {
              "E": "Jiraiya เป็นคนที่ชอบเข้าสังคมและมีเสน่ห์ในการสื่อสาร",
              "S": "เขาใช้ประสบการณ์ตรงจากการผจญภัยและการฝึกฝนเพื่อวิเคราะห์สถานการณ์",
              "T": "ตัดสินใจด้วยความเฉียบแหลมและความรู้ที่สะสมจากประสบการณ์ในสนามรบ",
              "P": "Jiraiya ปรับเปลี่ยนกลยุทธ์และวิธีการต่อสู้ได้อย่างคล่องแคล่วตามสถานการณ์"
            }
          }
        ]
      },
      "ISFP": {
        "title": "นักสำรวจที่มีความอ่อนโยนและชื่นชอบศิลปะในความเป็นจริง",
        "characters": [
          {
            "name": "Genya Shinazugawa",
            "anime": "Demon Slayer",
            "traits": {
              "I": "Genya มักเก็บความรู้สึกไว้ภายในและทำงานโดยใช้สัญชาตญาณส่วนตัว",
              "S": "เขาเน้นการใช้ประสบการณ์ตรงและข้อมูลจากสนามรบ",
              "F": "แม้จะแสดงออกน้อย แต่ในความเป็นจริง Genya มีความรู้สึกที่ซ่อนเร้นและใส่ใจในทีม",
              "P": "มีความยืดหยุ่นในการปรับเปลี่ยนวิธีการต่อสู้เมื่อต้องเผชิญกับความท้าทายใหม่ ๆ"
            }
          },
          {
            "name": "Taki Tachibana",
            "anime": "Your Name",
            "traits": {
              "I": "แม้จะเข้าสังคมได้ดี แต่ Taki ค่อนข้างเป็นคนเก็บตัวและชอบใช้เวลาอยู่กับตัวเอง",
              "S": "ใส่ใจรายละเอียด ชอบสัมผัสกับโลกจริงผ่านประสบการณ์ตรง เช่น งานพาร์ทไทม์ ศิลปะ และอาหาร",
              "F": "ตัดสินใจจากอารมณ์และคุณค่าภายใน มีความเห็นอกเห็นใจและลึกซึ้งกับความรู้สึกของคนรอบข้าง",
              "P": "ค่อนข้างยืดหยุ่นและพร้อมรับมือกับสถานการณ์ที่เปลี่ยนแปลงได้"
            }
          },
          {
            "name": "Shoto Todoroki",
            "anime": "My Hero Academia",
            "traits": {
              "I": "Todoroki มีลักษณะสงบและชอบคิดวิเคราะห์ในใจ",
              "S": "เขาเน้นการใช้ประสบการณ์ตรงและความรู้สึกที่จับต้องได้จากการฝึกฝน",
              "F": "ตัดสินใจด้วยความรู้สึกส่วนตัว โดยมองหาความสมดุลระหว่างพลังด้านความเย็นและร้อน",
              "P": "Todoroki สามารถปรับตัวได้ในสถานการณ์ต่าง ๆ และพร้อมทดลองวิธีการใหม่ ๆ ในการต่อสู้"
            }
          },
          {
            "name": "Inori Yuzuriha",
            "anime": "Guilty Crown",
            "traits": {
              "I": "Inori ชอบเก็บความรู้สึกไว้ภายในและมักจะใช้เวลาในการไตร่ตรอง",
              "S": "เธอให้ความสำคัญกับความงดงามและประสบการณ์ตรงในงานศิลป์และชีวิต",
              "F": "ตัดสินใจด้วยความรู้สึกและความปรารถนาที่จะสร้างสรรค์สิ่งที่สวยงาม",
              "P": "Inori มีความยืดหยุ่นในการปรับเปลี่ยนแนวทางและพร้อมรับความเปลี่ยนแปลงในสภาพแวดล้อมที่หลากหลาย"
            }
          }
        ]
      },
      "ESFP": {
        "title": "ผู้ให้ความบันเทิงที่มีจิตใจสดใสและเป็นมิตร",
        "characters": [
          {
            "name": "Mina Ashido",
            "anime": "My Hero Academia",
            "traits": {
              "E": "Mina มีบุคลิกที่สดใสและเข้าถึงเพื่อนร่วมทีมได้ง่าย",
              "S": "เธอเน้นการตอบสนองต่อสิ่งที่เกิดขึ้นจริงในสนามรบด้วยสัญชาตญาณ",
              "F": "ตัดสินใจด้วยความรู้สึกและมุ่งหวังที่จะสร้างความสุขให้กับคนรอบข้าง",
              "P": "Mina มีความยืดหยุ่นในการปรับตัวและพร้อมทดลองสิ่งใหม่ ๆ ในทุกสถานการณ์"
            }
          },
          {
            "name": "Gon Freecss",
            "anime": "Hunter x Hunter",
            "traits": {
              "E": "Gon เป็นคนที่เปี่ยมไปด้วยพลังงานและเข้ากับผู้คนได้ง่าย",
              "S": "เขาเน้นประสบการณ์ตรงและตอบสนองทันทีต่อสถานการณ์ที่เกิดขึ้น",
              "F": "ตัดสินใจด้วยความรู้สึกที่เรียบง่ายและมุ่งเน้นความรักในการผจญภัย",
              "P": "Gon ปรับตัวได้อย่างรวดเร็วและเปิดรับประสบการณ์ใหม่ ๆ ในทุกการผจญภัย"
            }
          },
          {
            "name": "Brook",
            "anime": "One Piece",
            "traits": {
              "E": "Brook เป็นนักแสดงที่มีความสนุกสนานและเปิดเผยในทุกสถานการณ์",
              "S": "เขาเน้นการใช้ประสบการณ์ตรงในโลกของการแสดงและดนตรี",
              "F": "ตัดสินใจด้วยความรู้สึกและมอบความอบอุ่นให้กับเพื่อนร่วมทีม",
              "P": "Brook มีความยืดหยุ่นและสามารถปรับเปลี่ยนวิธีการแสดงออกตามสถานการณ์ที่เปลี่ยนแปลง"
            }
          },
          {
            "name": "Kaminari Denki",
            "anime": "My Hero Academia",
            "traits": {
              "E": "Denki เป็นคนที่เข้ากับสังคมได้ง่ายและชอบแสดงออกด้วยความกระตือรือร้น",
              "S": "เขาเน้นการตอบสนองต่อสิ่งที่เกิดขึ้นในสนามรบด้วยสัญชาตญาณที่จับต้องได้",
              "F": "การตัดสินใจของ Denki มาจากความรู้สึกและความปรารถนาที่จะมีความสนุกสนาน",
              "P": "เขามีความยืดหยุ่นและปรับตัวได้ดีเมื่อต้องเผชิญกับสถานการณ์ที่ไม่คาดคิด"
            }
          }
        ]
      }
    }
  }
}