{
    "INFJ": {
      "INFJ": {
        "compatibility": "90%",
        "description": "INFJ สองคนมักเข้าใจกันเป็นอย่างดีเพราะมีค่านิยมและความคิดคล้ายกัน ทั้งคู่ชอบความลึกซึ้งและความหมายในชีวิต แต่ปัญหาอาจเกิดขึ้นเมื่อทั้งคู่หลีกเลี่ยงความขัดแย้งและไม่กล้าแสดงความต้องการของตัวเอง"
      },
      "ENFP": {
        "compatibility": "95%",
        "description": "INFJ และ ENFP มักถูกดึงดูดกันเพราะทั้งคู่มีความคิดสร้างสรรค์และชอบการสนทนาเชิงลึก ENFP ช่วยให้ INFJ รู้สึกมีชีวิตชีวา ในขณะที่ INFJ ให้ความเข้าใจและความมั่นคงทางอารมณ์แก่ ENFP"
      },
      "ENTP": {
        "compatibility": "85%",
        "description": "INFJ และ ENTP มักสนุกกับการแลกเปลี่ยนความคิดเห็นเพราะทั้งคู่ชอบความคิดเชิงลึก อย่างไรก็ตาม ENTP อาจดูชอบโต้แย้งเกินไปสำหรับ INFJ ที่ต้องการความกลมเกลียว"
      },
      "INTJ": {
        "compatibility": "90%",
        "description": "INFJ และ INTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความคิดเชิงกลยุทธ์และวิสัยทัศน์ แต่ INTJ อาจดูเย็นชาเกินไปสำหรับ INFJ ที่ต้องการความอบอุ่นทางอารมณ์"
      },
      "INFP": {
        "compatibility": "92%",
        "description": "INFJ และ INFP มักเข้าใจกันดีเพราะทั้งคู่มีความอ่อนไหวและเห็นอกเห็นใจ แต่บางครั้งอาจมีปัญหาเพราะทั้งคู่ชอบหลีกเลี่ยงความขัดแย้ง"
      },
      "ENFJ": {
        "compatibility": "94%",
        "description": "INFJ และ ENFJ มักเข้ากันได้ดีเพราะทั้งคู่มีค่านิยมคล้ายกันและใส่ใจคนอื่น ENFJ ชอบเป็นผู้นำ ในขณะที่ INFJ ชอบสนับสนุน ซึ่งทำให้เป็นคู่ที่สมดุล"
      },
      "INTP": {
        "compatibility": "80%",
        "description": "INFJ และ INTP มักดึงดูดกันเพราะทั้งคู่ชอบความคิดเชิงลึก แต่ INTP อาจดูใช้เหตุผลเกินไปสำหรับ INFJ ที่เน้นความรู้สึก"
      },
      "ISTJ": {
        "compatibility": "70%",
        "description": "INFJ และ ISTJ อาจเข้ากันได้ยากเพราะ ISTJ ชอบความเป็นระเบียบและโครงสร้าง ในขณะที่ INFJ ชอบความยืดหยุ่น แต่หากเข้าใจกันก็สามารถเติมเต็มซึ่งกันและกันได้"
      },
      "ISFJ": {
        "compatibility": "88%",
        "description": "INFJ และ ISFJ มักเข้ากันได้ดีเพราะทั้งคู่มีความอ่อนไหวและใส่ใจคนอื่น แต่ ISFJ อาจดูอนุรักษ์นิยมเกินไปสำหรับ INFJ ที่ชอบความคิดสร้างสรรค์"
      },
      "ESTP": {
        "compatibility": "60%",
        "description": "INFJ และ ESTP อาจเข้ากันได้ยากเพราะ ESTP ชอบการกระทำและความตื่นเต้น ในขณะที่ INFJ ชอบความสงบและความคิดเชิงลึก แต่หากเรียนรู้ที่จะเข้าใจกันก็สามารถเติมเต็มซึ่งกันและกันได้"
      },
      "ESFP": {
        "compatibility": "65%",
        "description": "INFJ และ ESFP อาจมีปัญหาการสื่อสารเพราะ ESFP ชอบความสนุกสนานและสังคม ในขณะที่ INFJ ชอบความสงบและความลึกซึ้ง แต่ ESFP สามารถช่วยให้ INFJ ผ่อนคลายได้"
      },
      "ESTJ": {
        "compatibility": "55%",
        "description": "INFJ และ ESTJ อาจขัดแย้งกันเพราะ ESTJ ชอบความเป็นระเบียบและโครงสร้าง ในขณะที่ INFJ ชอบความยืดหยุ่นและความคิดสร้างสรรค์ แต่หากเข้าใจกันก็สามารถทำงานร่วมกันได้ดี"
      },
      "ESFJ": {
        "compatibility": "75%",
        "description": "INFJ และ ESFJ มักเข้ากันได้ดีเพราะทั้งคู่ใส่ใจคนอื่น แต่ ESFJ อาจดูเน้นสังคมเกินไปสำหรับ INFJ ที่ชอบความเป็นส่วนตัว"
      },
      "ISTP": {
        "compatibility": "68%",
        "description": "INFJ และ ISTP อาจเข้ากันได้ยากเพราะ ISTP ชอบความเป็นอิสระและการกระทำ ในขณะที่ INFJ ชอบความลึกซึ้งและความสัมพันธ์ แต่หากเข้าใจกันก็สามารถเติมเต็มซึ่งกันและกันได้"
      },
      "ISFP": {
        "compatibility": "85%",
        "description": "INFJ และ ISFP มักเข้ากันได้ดีเพราะทั้งคู่มีความอ่อนไหวและเห็นอกเห็นใจ แต่ ISFP อาจดูไม่ชอบวางแผนสำหรับ INFJ ที่ชอบการเตรียมการล่วงหน้า"
      },
      "ENTJ": {
        "compatibility": "75%",
        "description": "INFJ และ ENTJ มักดึงดูดกันเพราะทั้งคู่มีวิสัยทัศน์และความทะเยอทะยาน แต่ ENTJ อาจดูก้าวร้าวเกินไปสำหรับ INFJ ที่ต้องการความอ่อนโยน"
      }
    },
    "INFP": {
      "INFP": {
        "compatibility": "90%",
        "description": "INFP สองคนมักเข้าใจกันเป็นอย่างดีเพราะมีค่านิยมและความคิดคล้ายกัน ทั้งคู่ชอบความลึกซึ้งและความหมายในชีวิต แต่ปัญหาอาจเกิดขึ้นเมื่อทั้งคู่หลีกเลี่ยงความขัดแย้งและไม่กล้าแสดงความต้องการของตัวเอง"
      },
      "ENFJ": {
        "compatibility": "95%",
        "description": "INFP และ ENFJ มักถูกดึงดูดกันอย่างมาก เพราะ INFP ให้ความลึกซึ้งทางอารมณ์ที่ ENFJ ต้องการ ในขณะที่ ENFJ ให้การสนับสนุนและแรงบันดาลใจที่ INFP ต้องการ ทั้งคู่มีค่านิยมที่คล้ายกันและเข้าใจความรู้สึกของกันและกัน"
      },
      "ENFP": {
        "compatibility": "92%",
        "description": "INFP และ ENFP มักสนุกกับการแลกเปลี่ยนความคิดเห็นเพราะทั้งคู่ชอบความคิดเชิงลึก อย่างไรก็ตาม ENFP อาจดูชอบโต้แย้งเกินไปสำหรับ INFP ที่ต้องการความกลมเกลียว"
      },
      "INFJ": {
        "compatibility": "94%",
        "description": "INFP และ INFJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความคิดเชิงกลยุทธ์และวิสัยทัศน์ แต่ INFJ อาจดูเย็นชาเกินไปสำหรับ INFP ที่ต้องการความอบอุ่นทางอารมณ์"
      },
      "ISFP": {
        "compatibility": "88%",
        "description": "INFP และ ISFP มักเข้าใจกันดีเพราะทั้งคู่มีความอ่อนไหวและเห็นอกเห็นใจ แต่บางครั้งอาจมีปัญหาเพราะทั้งคู่ชอบหลีกเลี่ยงความขัดแย้ง"
      },
      "ENTP": {
        "compatibility": "85%",
        "description": "INFP และ ENTP มักเข้ากันได้ดีเพราะทั้งคู่มีค่านิยมคล้ายกันและใส่ใจคนอื่น ENTP ชอบเป็นผู้นำ ในขณะที่ INFP ชอบสนับสนุน ซึ่งทำให้เป็นคู่ที่สมดุล"
      },
      "INTP": {
        "compatibility": "80%",
        "description": "INFP และ INTP มักดึงดูดกันเพราะทั้งคู่ชอบความคิดเชิงลึก แต่ INTP อาจดูใช้เหตุผลเกินไปสำหรับ INFP ที่เน้นความรู้สึก"
      },
      "ISTJ": {
        "compatibility": "70%",
        "description": "INFP และ ISTJ อาจเข้ากันได้ยากเพราะ ISTJ ชอบความเป็นระเบียบและโครงสร้าง ในขณะที่ INFP ชอบความยืดหยุ่น แต่หากเข้าใจกันก็สามารถเติมเต็มซึ่งกันและกันได้"
      },
      "ISFJ": {
        "compatibility": "75%",
        "description": "INFP และ ISFJ มักเข้ากันได้ดีเพราะทั้งคู่มีความอ่อนไหวและใส่ใจคนอื่น แต่ ISFJ อาจดูอนุรักษ์นิยมเกินไปสำหรับ INFP ที่ชอบความคิดสร้างสรรค์"
      },
      "ESTP": {
        "compatibility": "60%",
        "description": "INFP และ ESTP อาจเข้ากันได้ยากเพราะ ESTP ชอบการกระทำและความตื่นเต้น ในขณะที่ INFP ชอบความสงบและความคิดเชิงลึก แต่หากเรียนรู้ที่จะเข้าใจกันก็สามารถเติมเต็มซึ่งกันและกันได้"
      },
      "ESFP": {
        "compatibility": "65%",
        "description": "INFP และ ESFP อาจมีปัญหาการสื่อสารเพราะ ESFP ชอบความสนุกสนานและสังคม ในขณะที่ INFP ชอบความสงบและความลึกซึ้ง แต่ ESFP สามารถช่วยให้ INFP ผ่อนคลายได้"
      },
      "ESTJ": {
        "compatibility": "55%",
        "description": "INFP และ ESTJ อาจขัดแย้งกันเพราะ ESTJ ชอบความเป็นระเบียบและโครงสร้าง ในขณะที่ INFP ชอบความยืดหยุ่นและความคิดสร้างสรรค์ แต่หากเข้าใจกันก็สามารถทำงานร่วมกันได้ดี"
      },
      "ESFJ": {
        "compatibility": "75%",
        "description": "INFP และ ESFJ มักเข้ากันได้ดีเพราะทั้งคู่ใส่ใจคนอื่น แต่ ESFJ อาจดูเน้นสังคมเกินไปสำหรับ INFP ที่ชอบความเป็นส่วนตัว"
      },
      "ISTP": {
        "compatibility": "68%",
        "description": "INFP และ ISTP อาจเข้ากันได้ยากเพราะ ISTP ชอบความเป็นอิสระและการกระทำ ในขณะที่ INFP ชอบความลึกซึ้งและความสัมพันธ์ แต่หากเข้าใจกันก็สามารถเติมเต็มซึ่งกันและกันได้"
      },
      "ENTJ": {
        "compatibility": "70%",
        "description": "INFP และ ENTJ มักดึงดูดกันเพราะทั้งคู่มีวิสัยทัศน์และความทะเยอทะยาน แต่ ENTJ อาจดูก้าวร้าวเกินไปสำหรับ INFP ที่ต้องการความอ่อนโยน"
      },
      "INTJ": {
        "compatibility": "85%",
        "description": "INFP และ INTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความคิดเชิงลึกและมีวิสัยทัศน์ แต่ INTJ อาจดูเย็นชาเกินไปสำหรับ INFP ที่ต้องการความอบอุ่นทางอารมณ์"
      }
    },
    "ENFJ": {
      "ENFJ": { "compatibility": "85%", "description": "ENFJ สองคนมักเข้าใจกันดีเพราะมีค่านิยมและวิสัยทัศน์ที่คล้ายกัน ทั้งคู่ชอบช่วยเหลือผู้อื่นและสร้างความเปลี่ยนแปลงเชิงบวก แต่อาจมีการแข่งขันกันเป็นผู้นำหรือให้ความสนใจผู้อื่นมากเกินไปจนละเลยความต้องการของตนเอง" },
      "INFP": { "compatibility": "95%", "description": "ENFJ และ INFP มักถูกดึงดูดกันอย่างมาก เพราะ INFP ให้ความลึกซึ้งทางอารมณ์ที่ ENFJ ต้องการ ในขณะที่ ENFJ ให้การสนับสนุนและแรงบันดาลใจที่ INFP ต้องการ ทั้งคู่มีค่านิยมที่คล้ายกันและเข้าใจความรู้สึกของกันและกัน" },
      "INFJ": { "compatibility": "94%", "description": "ENFJ และ INFJ มีความเข้าใจกันลึกซึ้ง ทั้งคู่มีความสามารถในการเข้าใจความรู้สึกของผู้อื่นและมีค่านิยมที่คล้ายกัน ENFJ ช่วยให้ INFJ เปิดเผยตัวตนมากขึ้น ในขณะที่ INFJ ช่วยให้ ENFJ มีความลึกซึ้งมากขึ้น" },
      "ENTP": { "compatibility": "82%", "description": "ENFJ และ ENTP มักมีการแลกเปลี่ยนความคิดเห็นที่น่าสนใจ ENTP ชอบท้าทายความคิดของ ENFJ ซึ่งช่วยให้เกิดการเติบโต แต่ ENFJ อาจรู้สึกว่า ENTP ไม่ใส่ใจความรู้สึกมากพอ" },
      "INTJ": { "compatibility": "80%", "description": "ENFJ และ INTJ สามารถเรียนรู้จากกันได้มาก INTJ ให้มุมมองเชิงวิเคราะห์ ในขณะที่ ENFJ ช่วยพัฒนาทักษะทางสังคมของ INTJ แต่อาจมีความท้าทายในการสื่อสารเรื่องอารมณ์" },
      "ENFP": { "compatibility": "88%", "description": "ENFJ และ ENFP มีพลังงานและความกระตือรือร้นที่คล้ายกัน ทั้งคู่ชอบสร้างแรงบันดาลใจให้ผู้อื่น แต่อาจมีปัญหาในการจัดการรายละเอียดหรือการทำให้แผนสำเร็จ" },
      "INTP": { "compatibility": "78%", "description": "ENFJ สามารถช่วยให้ INTP พัฒนาด้านอารมณ์และสังคม ในขณะที่ INTP ช่วยให้ ENFJ มีมุมมองที่เป็นตรรกะมากขึ้น แต่อาจมีความท้าทายในการสื่อสารความต้องการ" },
      "ISTJ": { "compatibility": "65%", "description": "ENFJ และ ISTJ มีวิธีการมองโลกที่แตกต่างกัน ISTJ ชอบความเป็นระเบียบและการทำตามประเพณี ในขณะที่ ENFJ ชอบความยืดหยุ่นและการเปลี่ยนแปลง แต่สามารถเรียนรู้จากจุดแข็งของกันและกันได้" },
      "ISFJ": { "compatibility": "75%", "description": "ENFJ และ ISFJ มีความใส่ใจผู้อื่นเหมือนกัน แต่มีวิธีการแสดงออกที่แตกต่างกัน ISFJ มักจะเงียบและระมัดระวังมากกว่า ในขณะที่ ENFJ มักจะแสดงออกและกระตือรือร้นมากกว่า" },
      "ESTP": { "compatibility": "62%", "description": "ENFJ และ ESTP มีความแตกต่างกันมากในการมองโลก ESTP เน้นปัจจุบันและการกระทำ ในขณะที่ ENFJ มองไปที่อนาคตและความรู้สึก แต่สามารถเติมเต็มส่วนที่อีกฝ่ายขาดได้" },
      "ESFP": { "compatibility": "70%", "description": "ENFJ และ ESFP มีความสนุกสนานและชอบเข้าสังคม แต่ ENFJ มักจะมองหาความหมายที่ลึกซึ้งมากกว่า ESFP ที่เน้นความสนุกในปัจจุบัน" },
      "ESTJ": { "compatibility": "60%", "description": "ENFJ และ ESTJ อาจมีความขัดแย้งในวิธีการนำและการตัดสินใจ ESTJ เน้นตรรกะและกฎระเบียบ ในขณะที่ ENFJ เน้นความรู้สึกและความยืดหยุ่น" },
      "ESFJ": { "compatibility": "82%", "description": "ENFJ และ ESFJ มีความเข้าใจกันดีในด้านการดูแลผู้อื่น แต่ ESFJ มักจะยึดติดกับประเพณีมากกว่า ENFJ ที่ชอบคิดนอกกรอบ" },
      "ISTP": { "compatibility": "58%", "description": "ENFJ และ ISTP มีความแตกต่างกันมาก ISTP ชอบความเป็นอิสระและการทำงานคนเดียว ในขณะที่ ENFJ ชอบการทำงานร่วมกับผู้อื่น แต่สามารถเรียนรู้มุมมองใหม่ๆ จากกันได้" },
      "ISFP": { "compatibility": "72%", "description": "ENFJ สามารถช่วยให้ ISFP แสดงออกมากขึ้น ในขณะที่ ISFP ช่วยให้ ENFJ เห็นความงามในความเรียบง่าย แต่อาจมีความท้าทายในการสื่อสารความต้องการ" },
      "ENTJ": { "compatibility": "78%", "description": "ENFJ และ ENTJ มีความเป็นผู้นำและความทะเยอทะยานเหมือนกัน แต่มีวิธีการนำที่แตกต่างกัน ENTJ เน้นประสิทธิภาพ ในขณะที่ ENFJ เน้นการพัฒนาคน"
      }
    },
    "ENFP": {
      "ENFP": { "compatibility": "85%", "description": "ENFP สองคนมักมีความสนุกสนานและเข้าใจกันดี ทั้งคู่มีความคิดสร้างสรรค์และชอบสำรวจความเป็นไปได้ใหม่ๆ แต่อาจมีปัญหาในการจัดการเรื่องทั่วไปหรือการทำให้แผนสำเร็จ เพราะทั้งคู่ชอบคิดมากกว่าลงมือทำ" },
      "INFJ": { "compatibility": "95%", "description": "ENFP และ INFJ มักมีความเข้ากันได้ดีมาก INFJ ให้ความลึกซึ้งและความมั่นคงที่ ENFP ต้องการ ในขณะที่ ENFP ช่วยให้ INFJ เปิดใจรับประสบการณ์ใหม่ๆ ทั้งคู่มีความเข้าใจในระดับจิตใจที่ลึกซึ้ง" },
      "INTJ": { "compatibility": "92%", "description": "ENFP และ INTJ มักดึงดูดกันแม้จะดูเหมือนตรงข้าม INTJ ให้โครงสร้างและความมั่นคงที่ ENFP ต้องการ ในขณะที่ ENFP นำความสนุกและความยืดหยุ่นมาสู่ชีวิตของ INTJ" },
      "INFP": { "compatibility": "88%", "description": "ENFP และ INFP เข้าใจกันดีในด้านความคิดสร้างสรรค์และค่านิยม ทั้งคู่ชอบสำรวจความเป็นไปได้ใหม่ๆ แต่อาจต้องระวังการหลงใหลในความฝันมากเกินไปจนละเลยความเป็นจริง" },
      "ENFJ": { "compatibility": "88%", "description": "ENFP และ ENFJ มีความกระตือรือร้นและความสร้างสรรค์ที่คล้ายกัน ทั้งคู่ชอบช่วยเหลือผู้อื่น แต่ ENFJ อาจดูจริงจังเกินไปสำหรับ ENFP ที่ชอบความยืดหยุ่น" },
      "ENTP": { "compatibility": "83%", "description": "ENFP และ ENTP มีความคิดสร้างสรรค์และความกระตือรือร้นที่คล้ายกัน ทั้งคู่ชอบการสำรวจความคิดใหม่ๆ แต่อาจมีปัญหาในการจัดการอารมณ์และการทำให้แผนสำเร็จ" },
      "INTP": { "compatibility": "78%", "description": "ENFP ชอบความคิดที่ลึกซึ้งของ INTP ในขณะที่ INTP ชื่นชมความกระตือรือร้นของ ENFP แต่อาจมีความท้าทายในการสื่อสารความรู้สึก" },
      "ISTJ": { "compatibility": "65%", "description": "ENFP และ ISTJ มีวิธีการมองโลกที่แตกต่างกันมาก ISTJ ชอบความมีระเบียบและการวางแผน ในขณะที่ ENFP ชอบความยืดหยุ่นและการเปลี่ยนแปลง แต่สามารถเรียนรู้จากกันได้" },
      "ISFJ": { "compatibility": "70%", "description": "ENFP สามารถนำความสนุกและความคิดสร้างสรรค์มาสู่ชีวิตของ ISFJ ในขณะที่ ISFJ ช่วยให้ ENFP มีความมั่นคงมากขึ้น แต่อาจมีความขัดแย้งในเรื่องการใช้ชีวิต" },
      "ESTP": { "compatibility": "72%", "description": "ENFP และ ESTP มีความกระตือรือร้นและชอบการผจญภัยเหมือนกัน แต่ ESTP มักจะเน้นที่ประสบการณ์ทางกายภาพ ในขณะที่ ENFP สนใจความคิดและความเป็นไปได้" },
      "ESFP": { "compatibility": "75%", "description": "ENFP และ ESFP มีความสนุกสนานและชอบสังคมเหมือนกัน แต่ ENFP มักจะสนใจความหมายที่ลึกซึ้งมากกว่า ESFP ที่เน้นความสนุกในปัจจุบัน" },
      "ESTJ": { "compatibility": "58%", "description": "ENFP และ ESTJ มีวิธีการมองโลกที่แตกต่างกันมาก ESTJ ชอบโครงสร้างและกฎระเบียบ ในขณะที่ ENFP ชอบความยืดหยุ่นและอิสระ แต่สามารถเติมเต็มจุดอ่อนของกันและกันได้" },
      "ESFJ": { "compatibility": "72%", "description": "ENFP และ ESFJ มีความสนใจในผู้อื่นเหมือนกัน แต่ ESFJ มักจะยึดติดกับประเพณีมากกว่า ENFP ที่ชอบท้าทายบรรทัดฐาน" },
      "ISTP": { "compatibility": "65%", "description": "ENFP และ ISTP มีความแตกต่างกันในการมองโลก แต่สามารถเรียนรู้จากกันได้ ISTP ช่วยให้ ENFP มีเหตุผลมากขึ้น ในขณะที่ ENFP ช่วยให้ ISTP เปิดใจกว้างขึ้น" },
      "ISFP": { "compatibility": "76%", "description": "ENFP และ ISFP มีความคิดสร้างสรรค์และชื่นชอบความงามเหมือนกัน แต่ ISFP มักจะเงียบและระมัดระวังมากกว่า ENFP ที่แสดงออกมากกว่า" },
      "ENTJ": { "compatibility": "76%", "description": "ENFP และ ENTJ สามารถสร้างทีมที่มีประสิทธิภาพได้ ENTJ ให้โครงสร้างและการวางแผน ในขณะที่ ENFP นำความคิดสร้างสรรค์และแรงบันดาลใจ"
      }
    },
    "ISTJ": {
      "ISTJ": { "compatibility": "90%", "description": "ISTJ สองคนมักเข้าใจกันดีเพราะมีค่านิยมและวิธีการทำงานที่คล้ายกัน ทั้งคู่ให้ความสำคัญกับความรับผิดชอบและความน่าเชื่อถือ แต่อาจขาดความยืดหยุ่นและการเปิดรับมุมมองใหม่ๆ" },
      "ESTJ": { "compatibility": "85%", "description": "ISTJ และ ESTJ มีวิธีคิดและการทำงานที่คล้ายกัน ทั้งคู่ชอบความมีระเบียบและการวางแผน ESTJ มักจะเป็นผู้นำในสังคม ในขณะที่ ISTJ สนับสนุนอยู่เบื้องหลัง" },
      "ISFJ": { "compatibility": "88%", "description": "ISTJ และ ISFJ มีความเข้าใจกันดีในเรื่องความรับผิดชอบและการให้ความสำคัญกับประเพณี ISFJ มีความอ่อนโยนมากกว่า ซึ่งช่วยเติมเต็มความเป็นเหตุเป็นผลของ ISTJ" },
      "ESFJ": { "compatibility": "82%", "description": "ISTJ และ ESFJ มีความเข้าใจกันในเรื่องค่านิยมและความรับผิดชอบ ESFJ ช่วยให้ ISTJ เปิดเผยความรู้สึกมากขึ้น แต่อาจรู้สึกว่า ESFJ ใส่ใจความรู้สึกผู้อื่นมากเกินไป" },
      "INFJ": { "compatibility": "70%", "description": "ISTJ และ INFJ มีความแตกต่างในวิธีมองโลก แต่ทั้งคู่ให้ความสำคัญกับความลึกซึ้ง INFJ ช่วยให้ ISTJ เข้าใจมิติทางอารมณ์มากขึ้น ในขณะที่ ISTJ ให้ความมั่นคงแก่ INFJ" },
      "ENFJ": { "compatibility": "65%", "description": "ISTJ และ ENFJ มีความแตกต่างในการแสดงออกและการตัดสินใจ ENFJ อาจรู้สึกว่า ISTJ เย็นชาเกินไป ในขณะที่ ISTJ อาจรู้สึกว่า ENFJ ใช้อารมณ์มากเกินไป" },
      "INTJ": { "compatibility": "78%", "description": "ISTJ และ INTJ มีความเป็นตรรกะเหมือนกัน แต่ INTJ มักจะชอบนวัตกรรมมากกว่า ISTJ ที่ชอบวิธีการแบบดั้งเดิม ทั้งคู่สามารถเรียนรู้จากมุมมองที่แตกต่างของกันและกัน" },
      "ENTJ": { "compatibility": "72%", "description": "ISTJ และ ENTJ มีความเป็นระเบียบและความรับผิดชอบเหมือนกัน แต่ ENTJ มักจะก้าวร้าวและชอบการเปลี่ยนแปลงมากกว่า ISTJ" },
      "INFP": { "compatibility": "60%", "description": "ISTJ และ INFP มีความแตกต่างกันมาก แต่สามารถเติมเต็มกันได้ INFP ช่วยให้ ISTJ เห็นมุมมองที่สร้างสรรค์ ในขณะที่ ISTJ ช่วยให้ INFP มีความมั่นคงมากขึ้น" },
      "ENFP": { "compatibility": "55%", "description": "ISTJ และ ENFP มีวิธีการมองโลกที่แตกต่างกันมาก ENFP อาจรู้สึกถูกจำกัดโดย ISTJ ในขณะที่ ISTJ อาจรู้สึกว่า ENFP ไม่มีความรับผิดชอบเพียงพอ" },
      "INTP": { "compatibility": "75%", "description": "ISTJ และ INTP มีความเป็นตรรกะเหมือนกัน แต่ INTP มักจะชอบทฤษฎีมากกว่าการปฏิบัติ ทั้งคู่สามารถเรียนรู้วิธีคิดที่แตกต่างจากกันและกัน" },
      "ENTP": { "compatibility": "58%", "description": "ISTJ และ ENTP มีความแตกต่างกันมากในวิธีคิดและการใช้ชีวิต ENTP ชอบท้าทายกฎเกณฑ์ ในขณะที่ ISTJ ให้ความสำคัญกับความมั่นคงและประเพณี" },
      "ISFP": { "compatibility": "72%", "description": "ISTJ และ ISFP มีความแตกต่างในวิธีการทำงาน แต่ทั้งคู่มีความจริงจังและซื่อสัตย์ ISFP ช่วยให้ ISTJ เห็นความงามในชีวิต" },
      "ESFP": { "compatibility": "65%", "description": "ISTJ และ ESFP มีวิธีการใช้ชีวิตที่แตกต่างกัน ESFP ชอบความสนุกและการผจญภัย ในขณะที่ ISTJ ชอบความมั่นคงและการวางแผน" },
      "ISTP": { "compatibility": "80%", "description": "ISTJ และ ISTP มีความเข้าใจกันในเรื่องความเป็นตรรกะและการทำงาน แต่ ISTP มีความยืดหยุ่นมากกว่าในการแก้ปัญหา" },
      "ESTP": { "compatibility": "68%", "description": "ISTJ และ ESTP มีความแตกต่างในการใช้ชีวิต ESTP ชอบความตื่นเต้นและการเสี่ยง ในขณะที่ ISTJ ชอบความปลอดภัยและความแน่นอน"
      }
    },
    "ISFJ": {
      "ISFJ": { "compatibility": "88%", "description": "ISFJ สองคนมักเข้าใจกันดีเพราะมีค่านิยมและความใส่ใจที่คล้ายกัน ทั้งคู่ให้ความสำคัญกับความมั่นคงและการดูแลกัน แต่อาจมีปัญหาในการแสดงความต้องการของตนเอง" },
      "ESFJ": { "compatibility": "85%", "description": "ISFJ และ ESFJ มีความเข้าใจกันดีในเรื่องการดูแลผู้อื่น ESFJ มักจะเป็นฝ่ายนำในสังคม ในขณะที่ ISFJ สนับสนุนอยู่เบื้องหลัง ทำให้เกิดความสมดุล" },
      "ISTJ": { "compatibility": "88%", "description": "ISFJ และ ISTJ มีความรับผิดชอบและความน่าเชื่อถือเหมือนกัน แต่ ISFJ มีความอ่อนโยนมากกว่า ซึ่งช่วยเติมเต็มความเป็นเหตุเป็นผลของ ISTJ" },
      "ESTJ": { "compatibility": "78%", "description": "ISFJ และ ESTJ มีความรับผิดชอบเหมือนกัน แต่ ESTJ อาจดูแข็งกร้าวเกินไปสำหรับ ISFJ ที่อ่อนโยนกว่า อย่างไรก็ตาม ทั้งคู่สามารถสร้างทีมที่มีประสิทธิภาพได้" },
      "INFJ": { "compatibility": "82%", "description": "ISFJ และ INFJ มีความเข้าใจในความรู้สึกของผู้อื่น แต่ INFJ มักจะมองภาพใหญ่ ในขณะที่ ISFJ ใส่ใจรายละเอียดปัจจุบัน ทั้งคู่สามารถเรียนรู้จากกันได้" },
      "ENFJ": { "compatibility": "75%", "description": "ISFJ และ ENFJ มีความใส่ใจผู้อื่นเหมือนกัน แต่ ENFJ มักจะกระตือรือร้นและแสดงออกมากกว่า ซึ่งอาจทำให้ ISFJ รู้สึกอึดอัด" },
      "INTJ": { "compatibility": "65%", "description": "ISFJ และ INTJ มีความแตกต่างในการมองโลก INTJ เน้นตรรกะและนวัตกรรม ในขณะที่ ISFJ เน้นประเพณีและความรู้สึก แต่สามารถเรียนรู้จากกันได้" },
      "ENTJ": { "compatibility": "60%", "description": "ISFJ และ ENTJ มีความแตกต่างมาก ENTJ อาจดูก้าวร้าวเกินไปสำหรับ ISFJ แต่ ENTJ สามารถช่วยให้ ISFJ พัฒนาความมั่นใจได้" },
      "INFP": { "compatibility": "76%", "description": "ISFJ และ INFP มีความเข้าใจในความรู้สึกของผู้อื่น แต่ INFP มักจะมีความคิดที่เป็นนามธรรมมากกว่า ทั้งคู่สามารถสร้างความสัมพันธ์ที่อบอุ่นได้" },
      "ENFP": { "compatibility": "70%", "description": "ISFJ และ ENFP มีความแตกต่างในการใช้ชีวิต ENFP ชอบการเปลี่ยนแปลงและความตื่นเต้น ในขณะที่ ISFJ ชอบความมั่นคง แต่สามารถเติมเต็มกันได้" },
      "INTP": { "compatibility": "68%", "description": "ISFJ และ INTP มีความแตกต่างในการตัดสินใจ INTP เน้นตรรกะ ในขณะที่ ISFJ เน้นความรู้สึก แต่สามารถเรียนรู้มุมมองใหม่ๆ จากกันได้" },
      "ENTP": { "compatibility": "62%", "description": "ISFJ และ ENTP มีความแตกต่างมาก ENTP ชอบโต้แย้งและท้าทาย ซึ่งอาจทำให้ ISFJ รู้สึกไม่มั่นคง แต่ ENTP สามารถช่วยให้ ISFJ มองโลกกว้างขึ้น" },
      "ISFP": { "compatibility": "82%", "description": "ISFJ และ ISFP มีความอ่อนโยนและใส่ใจผู้อื่นเหมือนกัน แต่ ISFP มักจะยืดหยุ่นกว่าในการทำตามกฎระเบียบ ทั้งคู่สามารถสร้างความสัมพันธ์ที่อบอุ่นได้" },
      "ESFP": { "compatibility": "75%", "description": "ISFJ และ ESFP มีความแตกต่างในการใช้ชีวิต ESFP ชอบความสนุกและการผจญภัย ในขณะที่ ISFJ ชอบความมั่นคง แต่ ESFP สามารถช่วยให้ ISFJ ผ่อนคลายได้" },
      "ISTP": { "compatibility": "72%", "description": "ISFJ และ ISTP มีความเงียบและชอบสังเกตเหมือนกัน แต่ ISTP มักจะเป็นอิสระมากกว่า ในขณะที่ ISFJ ยึดติดกับความรับผิดชอบมากกว่า" },
      "ESTP": { "compatibility": "65%", "description": "ISFJ และ ESTP มีความแตกต่างในการมองโลก ESTP ชอบความเสี่ยงและการผจญภัย ในขณะที่ ISFJ ชอบความปลอดภัยและความมั่นคง"
      }
    },
    "ESTJ": {
      "ESTJ": { "compatibility": "85%", "description": "ESTJ สองคนมักเข้าใจกันเป็นอย่างดีเพราะมีค่านิยมและความคิดคล้ายกัน ทั้งคู่ชอบความเป็นระเบียบและโครงสร้าง แต่ปัญหาอาจเกิดขึ้นเมื่อทั้งคู่ชอบควบคุมและไม่ยืดหยุ่น" },
      "ISTJ": { "compatibility": "90%", "description": "ESTJ และ ISTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความเป็นระเบียบและโครงสร้าง ISTJ ช่วยให้ ESTJ รู้สึกมั่นคง ในขณะที่ ESTJ ให้ความกระตือรือร้นและความเป็นผู้นำแก่ ISTJ" },
      "ESFJ": { "compatibility": "92%", "description": "ESTJ และ ESFJ มักถูกดึงดูดกันเพราะทั้งคู่ชอบความเป็นระเบียบและใส่ใจคนอื่น ESFJ ช่วยให้ ESTJ รู้สึกอบอุ่น ในขณะที่ ESTJ ให้ความมั่นคงและความเป็นผู้นำแก่ ESFJ" },
      "ISFJ": { "compatibility": "88%", "description": "ESTJ และ ISFJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความเป็นระเบียบและใส่ใจคนอื่น แต่ ISFJ อาจดูอ่อนไหวเกินไปสำหรับ ESTJ ที่ชอบความชัดเจน" },
      "ENTJ": { "compatibility": "85%", "description": "ESTJ และ ENTJ มักสนุกกับการแลกเปลี่ยนความคิดเห็นเพราะทั้งคู่ชอบความคิดเชิงกลยุทธ์ อย่างไรก็ตาม ENTJ อาจดูชอบควบคุมเกินไปสำหรับ ESTJ ที่ชอบความเป็นผู้นำ" },
      "INTJ": { "compatibility": "75%", "description": "ESTJ และ INTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความคิดเชิงกลยุทธ์และวิสัยทัศน์ แต่ INTJ อาจดูเย็นชาเกินไปสำหรับ ESTJ ที่ต้องการความอบอุ่นทางอารมณ์" },
      "ENTP": { "compatibility": "70%", "description": "ESTJ และ ENTP มักดึงดูดกันเพราะทั้งคู่ชอบความคิดเชิงลึก แต่ ENTP อาจดูชอบโต้แย้งเกินไปสำหรับ ESTJ ที่ต้องการความชัดเจน" },
      "INTP": { "compatibility": "65%", "description": "ESTJ และ INTP อาจเข้ากันได้ยากเพราะ INTP ชอบความเป็นอิสระและการคิดเชิงทฤษฎี ในขณะที่ ESTJ ชอบความเป็นระเบียบและการปฏิบัติ" },
      "ESTP": { "compatibility": "80%", "description": "ESTJ และ ESTP มักเข้ากันได้ดีเพราะทั้งคู่ชอบการกระทำและความตื่นเต้น แต่ ESTP อาจดูไม่ชอบวางแผนสำหรับ ESTJ ที่ชอบการเตรียมการล่วงหน้า" },
      "ISTP": { "compatibility": "75%", "description": "ESTJ และ ISTP มักเข้าใจกันดีเพราะทั้งคู่ชอบการกระทำและความเป็นอิสระ แต่ ISTP อาจดูไม่ชอบวางแผนสำหรับ ESTJ ที่ชอบการเตรียมการล่วงหน้า" },
      "ESFP": { "compatibility": "70%", "description": "ESTJ และ ESFP อาจมีปัญหาการสื่อสารเพราะ ESFP ชอบความสนุกสนานและสังคม ในขณะที่ ESTJ ชอบความเป็นระเบียบและโครงสร้าง แต่ ESFP สามารถช่วยให้ ESTJ ผ่อนคลายได้" },
      "ISFP": { "compatibility": "65%", "description": "ESTJ และ ISFP อาจเข้ากันได้ยากเพราะ ISFP ชอบความเป็นอิสระและความยืดหยุ่น ในขณะที่ ESTJ ชอบความเป็นระเบียบและโครงสร้าง" },
      "ENFJ": { "compatibility": "75%", "description": "ESTJ และ ENFJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความเป็นผู้นำและใส่ใจคนอื่น แต่ ENFJ อาจดูอ่อนไหวเกินไปสำหรับ ESTJ ที่ชอบความชัดเจน" },
      "INFJ": { "compatibility": "60%", "description": "ESTJ และ INFJ อาจเข้ากันได้ยากเพราะ INFJ ชอบความลึกซึ้งและความหมาย ในขณะที่ ESTJ ชอบความเป็นระเบียบและโครงสร้าง" },
      "ENFP": { "compatibility": "55%", "description": "ESTJ และ ENFP อาจขัดแย้งกันเพราะ ENFP ชอบความยืดหยุ่นและความคิดสร้างสรรค์ ในขณะที่ ESTJ ชอบความเป็นระเบียบและโครงสร้าง" },
      "INFP": { "compatibility": "50%", "description": "ESTJ และ INFP อาจเข้ากันได้ยากเพราะ INFP ชอบความลึกซึ้งและความหมาย ในขณะที่ ESTJ ชอบความเป็นระเบียบและโครงสร้าง"
      }
    },
    "ESFJ": {
      "ESFJ": { "compatibility": "85%", "description": "ESFJ สองคนมักเข้าใจกันเป็นอย่างดีเพราะมีค่านิยมและความคิดคล้ายกัน ทั้งคู่ชอบความอบอุ่นและความสัมพันธ์ที่ใกล้ชิด แต่ปัญหาอาจเกิดขึ้นเมื่อทั้งคู่ชอบควบคุมและไม่ยืดหยุ่น" },
      "ISFJ": { "compatibility": "90%", "description": "ESFJ และ ISFJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความอบอุ่นและใส่ใจคนอื่น ISFJ ช่วยให้ ESFJ รู้สึกมั่นคง ในขณะที่ ESFJ ให้ความกระตือรือร้นและความเป็นผู้นำแก่ ISFJ" },
      "ESTJ": { "compatibility": "92%", "description": "ESFJ และ ESTJ มักถูกดึงดูดกันเพราะทั้งคู่ชอบความเป็นระเบียบและใส่ใจคนอื่น ESTJ ช่วยให้ ESFJ รู้สึกมั่นคง ในขณะที่ ESFJ ให้ความอบอุ่นและความเอาใจใส่แก่ ESTJ" },
      "ISTJ": { "compatibility": "88%", "description": "ESFJ และ ISTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความเป็นระเบียบและใส่ใจคนอื่น แต่ ISTJ อาจดูเย็นชาเกินไปสำหรับ ESFJ ที่ต้องการความอบอุ่น" },
      "ENFJ": { "compatibility": "85%", "description": "ESFJ และ ENFJ มักสนุกกับการแลกเปลี่ยนความคิดเห็นเพราะทั้งคู่ชอบความคิดสร้างสรรค์ อย่างไรก็ตาม ENFJ อาจดูชอบควบคุมเกินไปสำหรับ ESFJ ที่ชอบความเป็นผู้นำ" },
      "INFJ": { "compatibility": "75%", "description": "ESFJ และ INFJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความคิดสร้างสรรค์และวิสัยทัศน์ แต่ INFJ อาจดูเย็นชาเกินไปสำหรับ ESFJ ที่ต้องการความอบอุ่นทางอารมณ์" },
      "ENFP": { "compatibility": "70%", "description": "ESFJ และ ENFP มักดึงดูดกันเพราะทั้งคู่ชอบความคิดสร้างสรรค์ แต่ ENFP อาจดูชอบโต้แย้งเกินไปสำหรับ ESFJ ที่ต้องการความชัดเจน" },
      "INFP": { "compatibility": "65%", "description": "ESFJ และ INFP อาจเข้ากันได้ยากเพราะ INFP ชอบความเป็นอิสระและการคิดเชิงทฤษฎี ในขณะที่ ESFJ ชอบความเป็นระเบียบและการปฏิบัติ" },
      "ESFP": { "compatibility": "80%", "description": "ESFJ และ ESFP มักเข้ากันได้ดีเพราะทั้งคู่ชอบการกระทำและความตื่นเต้น แต่ ESFP อาจดูไม่ชอบวางแผนสำหรับ ESFJ ที่ชอบการเตรียมการล่วงหน้า" },
      "ISFP": { "compatibility": "75%", "description": "ESFJ และ ISFP มักเข้าใจกันดีเพราะทั้งคู่ชอบการกระทำและความเป็นอิสระ แต่ ISFP อาจดูไม่ชอบวางแผนสำหรับ ESFJ ที่ชอบการเตรียมการล่วงหน้า" },
      "ESTP": { "compatibility": "70%", "description": "ESFJ และ ESTP อาจมีปัญหาการสื่อสารเพราะ ESTP ชอบความสนุกสนานและสังคม ในขณะที่ ESFJ ชอบความเป็นระเบียบและโครงสร้าง แต่ ESTP สามารถช่วยให้ ESFJ ผ่อนคลายได้" },
      "ISTP": { "compatibility": "65%", "description": "ESFJ และ ISTP อาจเข้ากันได้ยากเพราะ ISTP ชอบความเป็นอิสระและความยืดหยุ่น ในขณะที่ ESFJ ชอบความเป็นระเบียบและโครงสร้าง" },
      "ENTJ": { "compatibility": "75%", "description": "ESFJ และ ENTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความเป็นผู้นำและใส่ใจคนอื่น แต่ ENTJ อาจดูอ่อนไหวเกินไปสำหรับ ESFJ ที่ชอบความชัดเจน" },
      "INTJ": { "compatibility": "60%", "description": "ESFJ และ INTJ อาจเข้ากันได้ยากเพราะ INTJ ชอบความลึกซึ้งและความหมาย ในขณะที่ ESFJ ชอบความเป็นระเบียบและโครงสร้าง" },
      "ENTP": { "compatibility": "55%", "description": "ESFJ และ ENTP อาจขัดแย้งกันเพราะ ENTP ชอบความยืดหยุ่นและความคิดสร้างสรรค์ ในขณะที่ ESFJ ชอบความเป็นระเบียบและโครงสร้าง" },
      "INTP": { "compatibility": "50%", "description": "ESFJ และ INTP อาจเข้ากันได้ยากเพราะ INTP ชอบความลึกซึ้งและความหมาย ในขณะที่ ESFJ ชอบความเป็นระเบียบและโครงสร้าง"
      }
    },
    "INTJ": {
      "INTJ": { "compatibility": "85%", "description": "INTJ สองคนมักเข้าใจกันดีเพราะมีวิธีคิดและการมองโลกที่คล้ายกัน ทั้งคู่ให้คุณค่ากับความเป็นส่วนตัวและการพัฒนาตนเอง แต่อาจมีปัญหาในการแสดงออกทางอารมณ์" },
      "ENTJ": { "compatibility": "90%", "description": "INTJ และ ENTJ มักเข้ากันได้ดีมากเพราะทั้งคู่มีความทะเยอทะยานและชอบความท้าทายทางปัญญา ENTJ ช่วยให้ INTJ เปิดกว้างขึ้น ในขณะที่ INTJ ช่วยให้ ENTJ คิดรอบคอบมากขึ้น" },
      "INTP": { "compatibility": "88%", "description": "INTJ และ INTP มักถูกดึงดูดกันด้วยความสนใจในการวิเคราะห์และทฤษฎี ทั้งคู่สามารถมีการสนทนาที่ลึกซึ้งและน่าสนใจ แม้ว่า INTP อาจจะไม่เป็นระบบพอสำหรับ INTJ" },
      "ENTP": { "compatibility": "85%", "description": "INTJ และ ENTP มักมีการแลกเปลี่ยนความคิดที่น่าสนใจ ทั้งคู่ชอบการโต้เถียงทางปัญญา แต่ ENTP อาจดูวุ่นวายเกินไปสำหรับ INTJ ที่ชอบความเป็นระเบียบ" },
      "INFJ": { "compatibility": "82%", "description": "INTJ และ INFJ มักเข้าใจกันดีเพราะทั้งคู่มีความลึกซึ้งและมองการณ์ไกล แต่ INFJ อาจดูอ่อนไหวเกินไปสำหรับ INTJ ที่ชอบความมีเหตุผล" },
      "ENFJ": { "compatibility": "75%", "description": "INTJ และ ENFJ สามารถเติมเต็มจุดอ่อนของกันและกัน ENFJ ช่วยให้ INTJ พัฒนาด้านอารมณ์ ในขณะที่ INTJ ช่วยให้ ENFJ มีเหตุผลมากขึ้น" },
      "INFP": { "compatibility": "70%", "description": "INTJ และ INFP มักแบ่งปันความสนใจในแนวคิดที่ลึกซึ้ง แต่วิธีการเข้าถึงอาจแตกต่างกัน INFP อาจดูอ่อนไหวเกินไปสำหรับ INTJ" },
      "ENFP": { "compatibility": "80%", "description": "INTJ และ ENFP มักดึงดูดกันแบบตรงข้าม ENFP นำความสนุกและความคิดสร้างสรรค์มาสู่ชีวิตของ INTJ แต่อาจมีความขัดแย้งในเรื่องการจัดการ" },
      "ISTJ": { "compatibility": "65%", "description": "INTJ และ ISTJ มีความเป็นระเบียบเหมือนกัน แต่ ISTJ อาจดูยึดติดกับประเพณีเกินไปสำหรับ INTJ ที่ชอบนวัตกรรม" },
      "ESTJ": { "compatibility": "60%", "description": "INTJ และ ESTJ อาจมีปัญหาในการสื่อสารเพราะ ESTJ มักเน้นการปฏิบัติและกฎระเบียบ ในขณะที่ INTJ ชอบคิดนอกกรอบ" },
      "ISFJ": { "compatibility": "55%", "description": "INTJ และ ISFJ มักมีความยากลำบากในการเข้าใจกัน ISFJ อาจดูอนุรักษ์นิยมเกินไปสำหรับ INTJ ที่ชอบการเปลี่ยนแปลง" },
      "ESFJ": { "compatibility": "50%", "description": "INTJ และ ESFJ มักมีความยากลำบากในการสื่อสาร ESFJ อาจดูเน้นอารมณ์เกินไปสำหรับ INTJ ที่ชอบความมีเหตุผล" },
      "ISTP": { "compatibility": "70%", "description": "INTJ และ ISTP มักเข้าใจการทำงานของกันและกัน แต่ ISTP อาจดูไม่มีเป้าหมายระยะยาวพอสำหรับ INTJ" },
      "ESTP": { "compatibility": "45%", "description": "INTJ และ ESTP มักมีความยากลำบากในการเข้าใจกัน ESTP อาจดูหุนหันพลันแล่นเกินไปสำหรับ INTJ ที่ชอบการวางแผน" },
      "ISFP": { "compatibility": "40%", "description": "INTJ และ ISFP มักมีความยากลำบากในการสื่อสาร ISFP อาจดูไม่มีโครงสร้างพอสำหรับ INTJ ที่ชอบระบบ" },
      "ESFP": { "compatibility": "35%", "description": "INTJ และ ESFP มักมีความยากลำบากมากที่สุดในการเข้าใจกัน ESFP อาจดูฉาบฉวยเกินไปสำหรับ INTJ ที่ชอบความลึกซึ้ง"
      }
    },
    "INTP": {
      "INTP": { "compatibility": "85%", "description": "INTP สองคนมักเข้าใจกันดีเยี่ยมในด้านความคิดและการใช้ตรรกะ ทั้งคู่สามารถมีการสนทนาที่ลึกซึ้งและน่าสนใจ แต่อาจมีปัญหาในการจัดการชีวิตประจำวันและการแสดงออกทางอารมณ์" },
      "ENTP": { "compatibility": "92%", "description": "INTP และ ENTP มักเข้ากันได้ดีมาก เพราะทั้งคู่ชอบการอภิปรายทางปัญญาและการสำรวจแนวคิดใหม่ๆ ENTP ช่วยให้ INTP เปิดกว้างทางสังคมมากขึ้น ในขณะที่ INTP ช่วยให้ ENTP คิดลึกซึ้งขึ้น" },
      "INTJ": { "compatibility": "88%", "description": "INTP และ INTJ มักถูกดึงดูดกันด้วยความสนใจในการวิเคราะห์และทฤษฎี ทั้งคู่ชอบการคิดเชิงระบบ แม้ว่า INTJ อาจจะเป็นระเบียบมากเกินไปสำหรับ INTP ที่ยืดหยุ่นกว่า" },
      "ENTJ": { "compatibility": "85%", "description": "INTP และ ENTJ มักมีความสัมพันธ์ที่น่าสนใจ ENTJ ชื่นชมความฉลาดของ INTP ในขณะที่ INTP ชื่นชมความมุ่งมั่นของ ENTJ แต่อาจมีความขัดแย้งในเรื่องการควบคุม" },
      "INFJ": { "compatibility": "80%", "description": "INTP และ INFJ มักดึงดูดกันด้วยความสนใจในการค้นหาความจริงและความหมายที่ลึกซึ้ง INFJ ช่วยให้ INTP เข้าใจอารมณ์มากขึ้น ในขณะที่ INTP ช่วยให้ INFJ มีมุมมองที่เป็นตรรกะมากขึ้น" },
      "ENFJ": { "compatibility": "75%", "description": "INTP และ ENFJ มักเติมเต็มซึ่งกันและกัน ENFJ ช่วยให้ INTP พัฒนาทักษะทางสังคม ในขณะที่ INTP ช่วยให้ ENFJ มีมุมมองที่เป็นกลางมากขึ้น" },
      "INFP": { "compatibility": "78%", "description": "INTP และ INFP มักแบ่งปันความสนใจในการสำรวจแนวคิดและทฤษฎี แม้ว่าจะมีวิธีการที่แตกต่างกัน INFP ช่วยให้ INTP เข้าใจคุณค่าและความรู้สึกมากขึ้น" },
      "ENFP": { "compatibility": "82%", "description": "INTP และ ENFP มักดึงดูดกันด้วยความคิดสร้างสรรค์และการสำรวจความเป็นไปได้ใหม่ๆ ENFP นำความสนุกและความกระตือรือร้นมาสู่ชีวิตของ INTP" },
      "ISTJ": { "compatibility": "60%", "description": "INTP และ ISTJ อาจมีความยากลำบากในการเข้าใจกัน ISTJ อาจดูยึดติดกับกฎระเบียบเกินไปสำหรับ INTP ที่ชอบความยืดหยุ่น" },
      "ESTJ": { "compatibility": "55%", "description": "INTP และ ESTJ มักมีมุมมองที่แตกต่างกันมาก ESTJ อาจดูเน้นการควบคุมเกินไปสำหรับ INTP ที่ต้องการอิสระในการคิด" },
      "ISFJ": { "compatibility": "50%", "description": "INTP และ ISFJ มักมีความยากลำบากในการสื่อสาร ISFJ อาจดูเน้นรายละเอียดและประเพณีเกินไปสำหรับ INTP" },
      "ESFJ": { "compatibility": "45%", "description": "INTP และ ESFJ มักมีความยากลำบากในการเข้าใจกัน ESFJ อาจดูเน้นการเข้าสังคมและกฎเกณฑ์เกินไปสำหรับ INTP" },
      "ISTP": { "compatibility": "75%", "description": "INTP และ ISTP มักเข้าใจกันดีในด้านการคิดเชิงตรรกะ แม้ว่า ISTP จะเน้นการปฏิบัติมากกว่าทฤษฎี" },
      "ESTP": { "compatibility": "50%", "description": "INTP และ ESTP มักมีความยากลำบากในการเข้าใจกัน ESTP อาจดูเน้นการกระทำและความตื่นเต้นเกินไปสำหรับ INTP" },
      "ISFP": { "compatibility": "45%", "description": "INTP และ ISFP มักมีความยากลำบากในการสื่อสาร ISFP อาจดูเน้นความรู้สึกและประสบการณ์เกินไปสำหรับ INTP" },
      "ESFP": { "compatibility": "40%", "description": "INTP และ ESFP มักมีความยากลำบากมากที่สุดในการเข้าใจกัน ESFP อาจดูเน้นความสนุกสนานและการเข้าสังคมเกินไปสำหรับ INTP"
      }
    },
    "ENTJ": {
      "ENTJ": { "compatibility": "75%", "description": "ENTJ สองคนมีความเข้าใจในวิธีคิดและเป้าหมายของกันและกัน แต่อาจมีการแข่งขันสูงและความขัดแย้งในการเป็นผู้นำ ทั้งคู่ต้องเรียนรู้การประนีประนอม" },
      "INTJ": { "compatibility": "90%", "description": "ENTJ และ INTJ มักเข้ากันได้ดีมาก เพราะทั้งคู่มีความทะเยอทะยานและชอบการวางแผนระยะยาว INTJ ช่วยให้ ENTJ คิดรอบคอบขึ้น ในขณะที่ ENTJ ช่วยให้ INTJ กล้าแสดงออกมากขึ้น" },
      "INTP": { "compatibility": "85%", "description": "ENTJ และ INTP มักมีการแลกเปลี่ยนความคิดที่น่าสนใจ INTP ชื่นชมความมุ่งมั่นของ ENTJ ในขณะที่ ENTJ ชื่นชมความฉลาดของ INTP แต่อาจมีความขัดแย้งในเรื่องการตัดสินใจ" },
      "ENTP": { "compatibility": "82%", "description": "ENTJ และ ENTP มักมีพลังงานและความคิดสร้างสรรค์ที่เข้ากันได้ดี ทั้งคู่ชอบการโต้เถียงและการแก้ปัญหา แต่ ENTP อาจดูไม่มีระเบียบพอสำหรับ ENTJ" },
      "INFJ": { "compatibility": "78%", "description": "ENTJ และ INFJ มักดึงดูดกันแบบตรงข้าม INFJ ช่วยให้ ENTJ พัฒนาด้านอารมณ์ ในขณะที่ ENTJ ช่วยให้ INFJ มีความมั่นใจมากขึ้น" },
      "ENFJ": { "compatibility": "80%", "description": "ENTJ และ ENFJ มักเข้าใจความเป็นผู้นำของกันและกัน ทั้งคู่มีวิสัยทัศน์และความทะเยอทะยาน แต่ ENFJ อาจดูอ่อนไหวเกินไปสำหรับ ENTJ" },
      "INFP": { "compatibility": "65%", "description": "ENTJ และ INFP อาจมีความท้าทายในการสื่อสาร INFP อาจรู้สึกถูกครอบงำโดย ENTJ ในขณะที่ ENTJ อาจรู้สึกว่า INFP ไม่มีประสิทธิภาพ" },
      "ENFP": { "compatibility": "72%", "description": "ENTJ และ ENFP มักแบ่งปันความกระตือรือร้นและความคิดสร้างสรรค์ แต่อาจมีความขัดแย้งในเรื่องการจัดการและการตัดสินใจ" },
      "ISTJ": { "compatibility": "70%", "description": "ENTJ และ ISTJ มักเข้าใจความสำคัญของการทำงานหนัก แต่ ISTJ อาจดูอนุรักษ์นิยมเกินไปสำหรับ ENTJ ที่ชอบนวัตกรรม" },
      "ESTJ": { "compatibility": "75%", "description": "ENTJ และ ESTJ มักเข้าใจการทำงานและความมุ่งมั่นของกันและกัน แต่อาจมีการแข่งขันในการเป็นผู้นำ" },
      "ISFJ": { "compatibility": "55%", "description": "ENTJ และ ISFJ มักมีความยากลำบากในการเข้าใจกัน ISFJ อาจรู้สึกถูกข่มขู่โดยความเข้มแข็งของ ENTJ" },
      "ESFJ": { "compatibility": "60%", "description": "ENTJ และ ESFJ อาจมีความขัดแย้งในวิธีการจัดการกับสถานการณ์ ESFJ อาจดูเน้นความรู้สึกมากเกินไปสำหรับ ENTJ" },
      "ISTP": { "compatibility": "68%", "description": "ENTJ และ ISTP มักเข้าใจความเป็นตรรกะของกันและกัน แต่ ISTP อาจรู้สึกถูกควบคุมโดย ENTJ" },
      "ESTP": { "compatibility": "65%", "description": "ENTJ และ ESTP มักแบ่งปันความกระตือรือร้น แต่อาจมีความขัดแย้งในเรื่องการวางแผนระยะยาว" },
      "ISFP": { "compatibility": "45%", "description": "ENTJ และ ISFP มักมีความยากลำบากในการเข้าใจกัน ISFP อาจรู้สึกถูกกดดันโดยความเข้มงวดของ ENTJ" },
      "ESFP": { "compatibility": "50%", "description": "ENTJ และ ESFP มักมีความแตกต่างในการมองโลก ESFP อาจดูไม่จริงจังพอสำหรับ ENTJ"
      }
    },
    "ENTP": {
      "ENTP": { "compatibility": "80%", "description": "ENTP สองคนมักสนุกกับการแลกเปลี่ยนความคิดและการโต้เถียง ทั้งคู่เข้าใจความต้องการอิสระและการสำรวจแนวคิดใหม่ๆ แต่อาจมีปัญหาในการจัดการชีวิตประจำวันและการตัดสินใจ" },
      "INTP": { "compatibility": "92%", "description": "ENTP และ INTP มักเข้ากันได้ดีมาก เพราะทั้งคู่ชอบการวิเคราะห์และการสำรวจแนวคิด ENTP ช่วยให้ INTP เปิดกว้างทางสังคม ในขณะที่ INTP ช่วยให้ ENTP คิดลึกซึ้งขึ้น" },
      "INTJ": { "compatibility": "85%", "description": "ENTP และ INTJ มักมีการแลกเปลี่ยนความคิดที่น่าสนใจ ทั้งคู่ชอบการคิดเชิงระบบ แม้ว่า INTJ อาจรู้สึกว่า ENTP วุ่นวายเกินไป" },
      "ENTJ": { "compatibility": "82%", "description": "ENTP และ ENTJ มักแบ่งปันความกระตือรือร้นและความทะเยอทะยาน แต่อาจมีการแข่งขันในการเป็นผู้นำความคิด ENTJ อาจรู้สึกว่า ENTP ไม่มีระเบียบพอ" },
      "INFJ": { "compatibility": "88%", "description": "ENTP และ INFJ มักดึงดูดกันแบบตรงข้าม INFJ ช่วยให้ ENTP เข้าใจอารมณ์มากขึ้น ในขณะที่ ENTP ช่วยให้ INFJ มองโลกในแง่มุมใหม่ๆ" },
      "ENFJ": { "compatibility": "75%", "description": "ENTP และ ENFJ มักแบ่งปันความกระตือรือร้นและความคิดสร้างสรรค์ แต่ ENFJ อาจรู้สึกว่า ENTP ชอบโต้แย้งมากเกินไป" },
      "INFP": { "compatibility": "78%", "description": "ENTP และ INFP มักแบ่งปันความสนใจในความคิดสร้างสรรค์ INFP ช่วยให้ ENTP เข้าใจคุณค่าและความรู้สึกมากขึ้น" },
      "ENFP": { "compatibility": "85%", "description": "ENTP และ ENFP มักสนุกกับการสำรวจความเป็นไปได้ใหม่ๆ ทั้งคู่มีความกระตือรือร้นและความคิดสร้างสรรค์ แต่อาจขาดความมั่นคง" },
      "ISTJ": { "compatibility": "55%", "description": "ENTP และ ISTJ มักมีความขัดแย้งในวิธีคิด ISTJ อาจรู้สึกว่า ENTP ไม่มีระเบียบและไม่น่าเชื่อถือ" },
      "ESTJ": { "compatibility": "50%", "description": "ENTP และ ESTJ มักมีความขัดแย้งในวิธีการทำงาน ESTJ อาจรู้สึกว่า ENTP ไม่จริงจังและชอบท้าทายกฎมากเกินไป" },
      "ISFJ": { "compatibility": "45%", "description": "ENTP และ ISFJ มักมีความยากลำบากในการเข้าใจกัน ISFJ อาจรู้สึกว่า ENTP ไม่มั่นคงและชอบโต้แย้งมากเกินไป" },
      "ESFJ": { "compatibility": "40%", "description": "ENTP และ ESFJ มักมีมุมมองที่แตกต่างกันมาก ESFJ อาจรู้สึกว่า ENTP ไม่ใส่ใจความรู้สึกของผู้อื่น" },
      "ISTP": { "compatibility": "72%", "description": "ENTP และ ISTP มักเข้าใจความต้องการอิสระของกันและกัน ทั้งคู่ชอบการแก้ปัญหาแม้จะมีวิธีการที่แตกต่างกัน" },
      "ESTP": { "compatibility": "68%", "description": "ENTP และ ESTP มักแบ่งปันความกระตือรือร้นและความยืดหยุ่น แต่อาจมีความขัดแย้งในเรื่องความลึกซึ้งของการคิด" },
      "ISFP": { "compatibility": "45%", "description": "ENTP และ ISFP มักมีความยากลำบากในการสื่อสาร ISFP อาจรู้สึกว่า ENTP ชอบวิเคราะห์มากเกินไป" },
      "ESFP": { "compatibility": "42%", "description": "ENTP และ ESFP มักมีความยากลำบากในการเข้าใจกัน ESFP อาจรู้สึกว่า ENTP ชอบถกเถียงและซับซ้อนเกินไป"
      }
    },
    "ISTP": {
    "ISTP": { "compatibility": "75%", "description": "ISTP สองคนมักเข้าใจความต้องการอิสระของกันและกัน ทั้งคู่ชอบทำกิจกรรมที่ท้าทายร่วมกัน แต่อาจมีปัญหาในการแสดงความรู้สึกและการสื่อสารทางอารมณ์" },
    "ESTP": { "compatibility": "85%", "description": "ISTP และ ESTP มักเข้ากันได้ดีเพราะทั้งคู่ชอบการผจญภัยและความท้าทาย ESTP ช่วยให้ ISTP เปิดกว้างทางสังคมมากขึ้น ในขณะที่ ISTP ช่วยให้ ESTP รอบคอบขึ้น" },
    "ISTJ": { "compatibility": "70%", "description": "ISTP และ ISTJ มักเข้าใจความต้องการความเป็นส่วนตัว แต่อาจมีความขัดแย้งในเรื่องการทำตามกฎระเบียบ ISTJ อาจรู้สึกว่า ISTP ไม่มีระเบียบพอ" },
    "ESTJ": { "compatibility": "65%", "description": "ISTP และ ESTJ มักมีความขัดแย้งในเรื่องการควบคุม ESTJ อาจพยายามจัดระเบียบ ISTP มากเกินไป ทำให้ ISTP รู้สึกอึดอัด" },
    "INTP": { "compatibility": "78%", "description": "ISTP และ INTP มักเข้าใจความต้องการอิสระทางความคิด ทั้งคู่ชอบการแก้ปัญหา แม้ว่า INTP จะชอบทฤษฎีมากกว่า ISTP ที่ชอบการปฏิบัติ" },
    "ENTP": { "compatibility": "72%", "description": "ISTP และ ENTP มักแบ่งปันความสนใจในการแก้ปัญหาและความยืดหยุ่น แต่ ENTP อาจพูดมากเกินไปสำหรับ ISTP" },
    "INTJ": { "compatibility": "68%", "description": "ISTP และ INTJ มักเข้าใจความต้องการความเป็นส่วนตัว แต่มีวิธีการทำงานที่แตกต่างกัน INTJ อาจวางแผนมากเกินไปสำหรับ ISTP" },
    "ENTJ": { "compatibility": "62%", "description": "ISTP และ ENTJ อาจมีความขัดแย้งในเรื่องการควบคุม ENTJ อาจพยายามนำมากเกินไปสำหรับ ISTP ที่ชอบอิสระ" },
    "ISFP": { "compatibility": "75%", "description": "ISTP และ ISFP มักเข้าใจความต้องการอิสระและการแสดงออกของกันและกัน แม้ว่า ISFP จะอ่อนไหวมากกว่า" },
    "ESFP": { "compatibility": "72%", "description": "ISTP และ ESFP มักสนุกกับกิจกรรมที่ท้าทายร่วมกัน แต่ ESFP อาจต้องการความใกล้ชิดทางอารมณ์มากกว่าที่ ISTP สะดวกใจ" },
    "ISFJ": { "compatibility": "55%", "description": "ISTP และ ISFJ มักมีความยากลำบากในการเข้าใจกัน ISFJ อาจต้องการความมั่นคงและการแสดงความรู้สึกมากกว่าที่ ISTP ให้ได้" },
    "ESFJ": { "compatibility": "45%", "description": "ISTP และ ESFJ มักมีความยากลำบากในการสื่อสาร ESFJ อาจรู้สึกว่า ISTP เย็นชาและไม่ใส่ใจความรู้สึก" },
    "INFP": { "compatibility": "58%", "description": "ISTP และ INFP มักมีความแตกต่างในการมองโลก INFP อาจต้องการการสนับสนุนทางอารมณ์มากกว่าที่ ISTP ถนัด" },
    "ENFP": { "compatibility": "55%", "description": "ISTP และ ENFP มักมีความแตกต่างในการสื่อสาร ENFP อาจพูดมากและแสดงออกมากเกินไปสำหรับ ISTP" },
    "INFJ": { "compatibility": "52%", "description": "ISTP และ INFJ มักมีความยากลำบากในการเข้าใจกัน INFJ อาจต้องการความลึกซึ้งทางอารมณ์มากกว่าที่ ISTP สะดวกใจ" },
    "ENFJ": { "compatibility": "48%", "description": "ISTP และ ENFJ มักมีความยากลำบากในการสื่อสาร ENFJ อาจพยายามเข้าใกล้และควบคุมมากเกินไปสำหรับ ISTP"
    }
  },
  "ISFP": {
    "ISFP": { "compatibility": "85%", "description": "ISFP สองคนมักเข้าใจกันเป็นอย่างดีเพราะมีค่านิยมและความคิดคล้ายกัน ทั้งคู่ชอบความอิสระและความสร้างสรรค์ แต่ปัญหาอาจเกิดขึ้นเมื่อทั้งคู่ชอบหลีกเลี่ยงความขัดแย้งและไม่กล้าแสดงความต้องการของตัวเอง" },
    "ESFP": { "compatibility": "90%", "description": "ISFP และ ESFP มักเข้ากันได้ดีเพราะทั้งคู่ชอบความสนุกสนานและความเป็นอิสระ ESFP ช่วยให้ ISFP รู้สึกมีชีวิตชีวา ในขณะที่ ISFP ให้ความเข้าใจและความมั่นคงทางอารมณ์แก่ ESFP" },
    "ISFJ": { "compatibility": "88%", "description": "ISFP และ ISFJ มักถูกดึงดูดกันเพราะทั้งคู่ชอบความอบอุ่นและใส่ใจคนอื่น ISFJ ช่วยให้ ISFP รู้สึกมั่นคง ในขณะที่ ISFP ให้ความสร้างสรรค์และความอิสระแก่ ISFJ" },
    "ESFJ": { "compatibility": "85%", "description": "ISFP และ ESFJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความอบอุ่นและใส่ใจคนอื่น แต่ ESFJ อาจดูชอบควบคุมเกินไปสำหรับ ISFP ที่ต้องการความอิสระ" },
    "ISTP": { "compatibility": "92%", "description": "ISFP และ ISTP มักสนุกกับการแลกเปลี่ยนความคิดเห็นเพราะทั้งคู่ชอบความคิดสร้างสรรค์ อย่างไรก็ตาม ISTP อาจดูชอบควบคุมเกินไปสำหรับ ISFP ที่ชอบความเป็นผู้นำ" },
    "ESTP": { "compatibility": "85%", "description": "ISFP และ ESTP มักเข้ากันได้ดีเพราะทั้งคู่ชอบความคิดสร้างสรรค์และวิสัยทัศน์ แต่ ESTP อาจดูเย็นชาเกินไปสำหรับ ISFP ที่ต้องการความอบอุ่นทางอารมณ์" },
    "INFP": { "compatibility": "80%", "description": "ISFP และ INFP มักดึงดูดกันเพราะทั้งคู่ชอบความคิดสร้างสรรค์ แต่ INFP อาจดูชอบโต้แย้งเกินไปสำหรับ ISFP ที่ต้องการความชัดเจน" },
    "ENFP": { "compatibility": "75%", "description": "ISFP และ ENFP อาจเข้ากันได้ยากเพราะ ENFP ชอบความเป็นอิสระและการคิดเชิงทฤษฎี ในขณะที่ ISFP ชอบความเป็นระเบียบและการปฏิบัติ" },
    "ISTJ": { "compatibility": "70%", "description": "ISFP และ ISTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบการกระทำและความตื่นเต้น แต่ ISTJ อาจดูไม่ชอบวางแผนสำหรับ ISFP ที่ชอบการเตรียมการล่วงหน้า" },
    "ESTJ": { "compatibility": "65%", "description": "ISFP และ ESTJ มักเข้าใจกันดีเพราะทั้งคู่ชอบการกระทำและความเป็นอิสระ แต่ ESTJ อาจดูไม่ชอบวางแผนสำหรับ ISFP ที่ชอบการเตรียมการล่วงหน้า" },
    "INFJ": { "compatibility": "75%", "description": "ISFP และ INFJ อาจมีปัญหาการสื่อสารเพราะ INFJ ชอบความสนุกสนานและสังคม ในขณะที่ ISFP ชอบความเป็นระเบียบและโครงสร้าง แต่ INFJ สามารถช่วยให้ ISFP ผ่อนคลายได้" },
    "ENFJ": { "compatibility": "70%", "description": "ISFP และ ENFJ อาจเข้ากันได้ยากเพราะ ENFJ ชอบความเป็นอิสระและความยืดหยุ่น ในขณะที่ ISFP ชอบความเป็นระเบียบและโครงสร้าง" },
    "INTJ": { "compatibility": "60%", "description": "ISFP และ INTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความเป็นผู้นำและใส่ใจคนอื่น แต่ INTJ อาจดูอ่อนไหวเกินไปสำหรับ ISFP ที่ชอบความชัดเจน" },
    "ENTJ": { "compatibility": "55%", "description": "ISFP และ ENTJ อาจเข้ากันได้ยากเพราะ ENTJ ชอบความลึกซึ้งและความหมาย ในขณะที่ ISFP ชอบความเป็นระเบียบและโครงสร้าง" },
    "INTP": { "compatibility": "50%", "description": "ISFP และ INTP อาจขัดแย้งกันเพราะ INTP ชอบความยืดหยุ่นและความคิดสร้างสรรค์ ในขณะที่ ISFP ชอบความเป็นระเบียบและโครงสร้าง" },
    "ENTP": { "compatibility": "45%", "description": "ISFP และ ENTP อาจเข้ากันได้ยากเพราะ ENTP ชอบความลึกซึ้งและความหมาย ในขณะที่ ISFP ชอบความเป็นระเบียบและโครงสร้าง"
    }
  },
  "ESTP": {
    "ESTP": { "compatibility": "85%", "description": "ESTP สองคนมักเข้าใจกันเป็นอย่างดีเพราะมีค่านิยมและความคิดคล้ายกัน ทั้งคู่ชอบความตื่นเต้นและการกระทำ แต่ปัญหาอาจเกิดขึ้นเมื่อทั้งคู่ชอบแข่งขันและไม่ยืดหยุ่น" },
    "ISTP": { "compatibility": "90%", "description": "ESTP และ ISTP มักเข้ากันได้ดีเพราะทั้งคู่ชอบความตื่นเต้นและการกระทำ ISTP ช่วยให้ ESTP รู้สึกมั่นคง ในขณะที่ ESTP ให้ความกระตือรือร้นและความเป็นผู้นำแก่ ISTP" },
    "ESFP": { "compatibility": "92%", "description": "ESTP และ ESFP มักถูกดึงดูดกันเพราะทั้งคู่ชอบความสนุกสนานและการกระทำ ESFP ช่วยให้ ESTP รู้สึกมีชีวิตชีวา ในขณะที่ ESTP ให้ความมั่นคงและความเป็นผู้นำแก่ ESFP" },
    "ISFP": { "compatibility": "88%", "description": "ESTP และ ISFP มักเข้ากันได้ดีเพราะทั้งคู่ชอบความตื่นเต้นและการกระทำ แต่ ISFP อาจดูอ่อนไหวเกินไปสำหรับ ESTP ที่ชอบความชัดเจน" },
    "ENTJ": { "compatibility": "85%", "description": "ESTP และ ENTJ มักสนุกกับการแลกเปลี่ยนความคิดเห็นเพราะทั้งคู่ชอบความคิดเชิงกลยุทธ์ อย่างไรก็ตาม ENTJ อาจดูชอบควบคุมเกินไปสำหรับ ESTP ที่ชอบความเป็นผู้นำ" },
    "INTJ": { "compatibility": "75%", "description": "ESTP และ INTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความคิดเชิงกลยุทธ์และวิสัยทัศน์ แต่ INTJ อาจดูเย็นชาเกินไปสำหรับ ESTP ที่ต้องการความอบอุ่นทางอารมณ์" },
    "ENTP": { "compatibility": "80%", "description": "ESTP และ ENTP มักดึงดูดกันเพราะทั้งคู่ชอบความคิดสร้างสรรค์ แต่ ENTP อาจดูชอบโต้แย้งเกินไปสำหรับ ESTP ที่ต้องการความชัดเจน" },
    "INTP": { "compatibility": "70%", "description": "ESTP และ INTP อาจเข้ากันได้ยากเพราะ INTP ชอบความเป็นอิสระและการคิดเชิงทฤษฎี ในขณะที่ ESTP ชอบความเป็นระเบียบและการปฏิบัติ" },
    "ESTJ": { "compatibility": "85%", "description": "ESTP และ ESTJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบการกระทำและความตื่นเต้น แต่ ESTJ อาจดูไม่ชอบวางแผนสำหรับ ESTP ที่ชอบการเตรียมการล่วงหน้า" },
    "ISTJ": { "compatibility": "75%", "description": "ESTP และ ISTJ มักเข้าใจกันดีเพราะทั้งคู่ชอบการกระทำและความเป็นอิสระ แต่ ISTJ อาจดูไม่ชอบวางแผนสำหรับ ESTP ที่ชอบการเตรียมการล่วงหน้า" },
    "ESFJ": { "compatibility": "70%", "description": "ESTP และ ESFJ อาจมีปัญหาการสื่อสารเพราะ ESFJ ชอบความสนุกสนานและสังคม ในขณะที่ ESTP ชอบความเป็นระเบียบและโครงสร้าง แต่ ESFJ สามารถช่วยให้ ESTP ผ่อนคลายได้" },
    "ISFJ": { "compatibility": "65%", "description": "ESTP และ ISFJ อาจเข้ากันได้ยากเพราะ ISFJ ชอบความเป็นอิสระและความยืดหยุ่น ในขณะที่ ESTP ชอบความเป็นระเบียบและโครงสร้าง" },
    "ENFJ": { "compatibility": "75%", "description": "ESTP และ ENFJ มักเข้ากันได้ดีเพราะทั้งคู่ชอบความเป็นผู้นำและใส่ใจคนอื่น แต่ ENFJ อาจดูอ่อนไหวเกินไปสำหรับ ESTP ที่ชอบความชัดเจน" },
    "INFJ": { "compatibility": "60%", "description": "ESTP และ INFJ อาจเข้ากันได้ยากเพราะ INFJ ชอบความลึกซึ้งและความหมาย ในขณะที่ ESTP ชอบความเป็นระเบียบและโครงสร้าง" },
    "ENFP": { "compatibility": "55%", "description": "ESTP และ ENFP อาจขัดแย้งกันเพราะ ENFP ชอบความยืดหยุ่นและความคิดสร้างสรรค์ ในขณะที่ ESTP ชอบความเป็นระเบียบและโครงสร้าง" },
    "INFP": { "compatibility": "50%", "description": "ESTP และ INFP อาจเข้ากันได้ยากเพราะ INFP ชอบความลึกซึ้งและความหมาย ในขณะที่ ESTP ชอบความเป็นระเบียบและโครงสร้าง"
    }
  },
  "ESFP": {
    "ESFP": { "compatibility": "90%", "description": "เมื่อ ESFP อยู่ด้วยกัน พวกเขาจะเต็มไปด้วยพลังงานและความสนุกสนาน ทั้งคู่เข้าใจถึงความต้องการอิสระและการใช้ชีวิตในปัจจุบัน แต่ความสัมพันธ์อาจมีปัญหาได้ถ้าทั้งคู่ไม่สามารถจัดการกับความรับผิดชอบได้ดีพอ" },
    "ESTP": { "compatibility": "92%", "description": "ESTP และ ESFP มีพลังงานใกล้เคียงกัน ทั้งคู่รักการผจญภัยและมีแนวโน้มที่จะกระตุ้นกันให้กล้าทำสิ่งใหม่ๆ ความสัมพันธ์นี้สนุกสนานและเต็มไปด้วยกิจกรรม แต่ ESTP อาจตรงไปตรงมาเกินไปสำหรับ ESFP ที่อ่อนไหวกว่าบ้าง" },
    "ISFP": { "compatibility": "85%", "description": "ทั้งคู่เป็นนักสำรวจและรักศิลปะ ESFP ช่วยให้ ISFP กล้าออกจากคอมฟอร์ตโซน ในขณะที่ ISFP ช่วยให้ ESFP ได้สัมผัสกับอารมณ์ที่ลึกซึ้งขึ้น แต่ปัญหาอาจเกิดขึ้นเมื่อ ISFP ต้องการเวลาส่วนตัวมากกว่า ESFP" },
    "ISTP": { "compatibility": "88%", "description": "ISTP มีความเป็นตัวของตัวเองและสงบ ในขณะที่ ESFP มีพลังงานและชอบเข้าสังคม ทั้งคู่สามารถเติมเต็มกันได้ดี ESFP สามารถกระตุ้นให้ ISTP สนุกกับชีวิตมากขึ้น ในขณะที่ ISTP สามารถสอน ESFP ให้คิดรอบคอบมากขึ้น" },
    "ENTJ": { "compatibility": "75%", "description": "ESFP และ ENTJ ต่างกันอย่างมาก ESFP ชอบความสนุกสนานและการใช้ชีวิตในปัจจุบัน ในขณะที่ ENTJ มุ่งมั่นกับเป้าหมายระยะยาว อย่างไรก็ตาม ENTJ สามารถช่วยให้ ESFP มีวินัยมากขึ้น ในขณะที่ ESFP สามารถช่วยให้ ENTJ ผ่อนคลายและสนุกกับชีวิต" },
    "INTJ": { "compatibility": "65%", "description": "INTJ ชอบวางแผนและใช้ตรรกะ ส่วน ESFP ชอบความสนุกและการเข้าสังคม ความสัมพันธ์นี้อาจท้าทายเพราะ INTJ อาจมองว่า ESFP ผิวเผิน ขณะที่ ESFP อาจมองว่า INTJ จริงจังเกินไป" },
    "ENTP": { "compatibility": "85%", "description": "ENTP และ ESFP ต่างมีพลังงานสูงและรักการผจญภัย ความสัมพันธ์นี้เต็มไปด้วยการพูดคุยที่กระตุ้นความคิดและการผจญภัยที่ไม่รู้จบ อย่างไรก็ตาม ENTP อาจใช้เหตุผลมากเกินไป ในขณะที่ ESFP ใช้อารมณ์มากกว่า" },
    "INTP": { "compatibility": "70%", "description": "ESFP และ INTP มีแนวทางชีวิตที่ต่างกันมาก INTP ชอบใช้เวลากับความคิด ส่วน ESFP ชอบออกไปข้างนอกและสนุกสนาน อย่างไรก็ตาม หากทั้งคู่เปิดใจเรียนรู้จากกัน พวกเขาจะสามารถช่วยพัฒนากันได้" },
    "ESTJ": { "compatibility": "80%", "description": "ESTJ เป็นคนจริงจังและมุ่งมั่น ขณะที่ ESFP เป็นคนชิลๆ และรักสนุก ความสัมพันธ์นี้อาจประสบความสำเร็จได้ถ้า ESTJ สามารถยอมรับความเป็นอิสระของ ESFP และ ESFP สามารถรับมือกับธรรมชาติที่เป็นผู้นำของ ESTJ" },
    "ISTJ": { "compatibility": "70%", "description": "ISTJ ชอบความมีระเบียบแบบแผน ขณะที่ ESFP เป็นคนรักอิสระและชอบความสนุกสนาน อาจมีความขัดแย้งเกิดขึ้นได้ แต่ถ้าต่างฝ่ายเคารพในสไตล์ของกันและกัน ความสัมพันธ์นี้สามารถทำให้ทั้งคู่เติบโตได้" },
    "ESFJ": { "compatibility": "90%", "description": "ทั้งสองเป็นคนชอบเข้าสังคมและให้ความสำคัญกับคนรอบข้าง ความสัมพันธ์นี้เต็มไปด้วยความอบอุ่นและความเข้าใจซึ่งกันและกัน อย่างไรก็ตาม ESFJ อาจต้องการโครงสร้างมากกว่า ESFP ที่ชอบความอิสระ" },
    "ISFJ": { "compatibility": "75%", "description": "ESFP และ ISFJ ต่างกันในด้านพลังงานและสไตล์การใช้ชีวิต ISFJ ชอบความมั่นคง ขณะที่ ESFP ชอบความตื่นเต้น หากทั้งคู่สามารถหาจุดกึ่งกลางได้ พวกเขาสามารถสร้างความสัมพันธ์ที่สมดุลกันได้" },
    "ENFJ": { "compatibility": "85%", "description": "ESFP และ ENFJ ต่างเป็นคนชอบเข้าสังคมและใส่ใจคนอื่น ENFJ สามารถช่วยให้ ESFP มีเป้าหมายมากขึ้น ขณะที่ ESFP สามารถช่วยให้ ENFJ ผ่อนคลายและสนุกกับชีวิตมากขึ้น" },
    "INFJ": { "compatibility": "65%", "description": "INFJ เป็นคนชอบคิดลึกซึ้งและมองหาเป้าหมายในชีวิต ขณะที่ ESFP ชอบอยู่กับปัจจุบัน ความสัมพันธ์นี้อาจเป็นเรื่องยาก แต่ถ้าทั้งคู่เปิดใจ พวกเขาสามารถเรียนรู้จากกันและกันได้" },
    "ENFP": { "compatibility": "95%", "description": "ENFP และ ESFP เป็นคู่ที่มีพลังงานสูงและรักการผจญภัย พวกเขาจะเข้าใจกันได้อย่างลึกซึ้งและกระตุ้นให้กันและกันสนุกกับชีวิต ความสัมพันธ์นี้เต็มไปด้วยความตื่นเต้นและการสำรวจสิ่งใหม่ๆ" },
    "INFP": { "compatibility": "75%", "description": "INFP เป็นคนชอบความสงบและลึกซึ้ง ในขณะที่ ESFP เป็นคนรักสนุกและใช้ชีวิตอย่างเต็มที่ ความสัมพันธ์นี้อาจต้องการการปรับตัว แต่ก็สามารถทำให้กันและกันเติบโตได้"
    }
  }
}